[Killed] LogicalOperator
src/modules/step/step.utils.ts:25:5
 function getFirstBusinessDayFrom(date: Date, holidays: Holidays) {
   const businessDay = new Date(date);
   while (
-    [0, 6].includes(businessDay.getDay()) || // Week-end
-    holidays.isHoliday(businessDay) // Holiday
+    [0, 6].includes(businessDay.getDay()) &&
+// Week-end
+holidays.isHoliday(businessDay) // Holiday // Holiday
   ) {
     businessDay.setUTCDate(businessDay.getUTCDate() + 1);
killedBy: calculateEmailDate should handle multiple consecutive holidays
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "dt": 2024-05-10T00:00:00.000Z,

[Killed] ConditionalExpression
src/modules/step/step.utils.ts:25:5
 function getFirstBusinessDayFrom(date: Date, holidays: Holidays) {
   const businessDay = new Date(date);
   while (
-    [0, 6].includes(businessDay.getDay()) || // Week-end
-    holidays.isHoliday(businessDay) // Holiday
+    false // Holiday
   ) {
     businessDay.setUTCDate(businessDay.getUTCDate() + 1);
killedBy: calculateEmailDate should handle multiple consecutive holidays
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "dt": 2024-05-10T00:00:00.000Z,

[Timeout] BlockStatement
src/modules/step/step.utils.ts:27:5
   while (
     [0, 6].includes(businessDay.getDay()) || // Week-end
     holidays.isHoliday(businessDay) // Holiday
-  ) {
-    businessDay.setUTCDate(businessDay.getUTCDate() + 1);
-  }
+  ) {}
   return businessDay;
 }

[Killed] BlockStatement
src/modules/step/step.utils.ts:43:17
  */
 export function generateStepDates(startDate: Date, endDate: Date, steps: Step[], country: string) {
   const diff = dayDiff(endDate, startDate);
-  if (diff < 0) {
-    throw new HttpException('Invalid parameter: startDate > endDate', HttpStatus.BAD_REQUEST);
-  }
+  if (diff < 0) {}
   const holidays = new Holidays(country, { types: ['public'] });
 
killedBy: calculateEmailDate should throw an error for start date > end date
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] EqualityOperator
src/modules/step/step.utils.ts:51:25
   return steps.map((step) => {
     const stepStartDate = new Date(startDate);
     const stepEndDate = new Date(endDate);
-    if (step.minDays && diff < step.minDays) {
+    if (step.minDays && diff >= step.minDays) {
       stepEndDate.setTime(startDate.getTime());
     } else if (step.maxDays && diff > step.maxDays) {
killedBy: calculateEmailDate should handle minimal interval correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 518400000

[Killed] LogicalOperator
src/modules/step/step.utils.ts:53:16
     const stepEndDate = new Date(endDate);
     if (step.minDays && diff < step.minDays) {
       stepEndDate.setTime(startDate.getTime());
-    } else if (step.maxDays && diff > step.maxDays) {
+    } else if (step.maxDays || diff > step.maxDays) {
       stepStartDate.setTime(endDate.getTime());
       stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
killedBy: StepService generateSteps should generate steps
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Object {
