[NoCoverage] ConditionalExpression
src/middleware/AuthGuard.ts:18:9
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const isPublic = this.reflector.get<boolean>('public', context.getHandler());
     // check if IsPublic is used in api
-    if (isPublic || this.configService.get('COGNITO_BY_PASS') === 'true') {
+    if (false) {
       // Allow public API access
       return true;

[NoCoverage] EqualityOperator
src/middleware/AuthGuard.ts:18:21
   async canActivate(context: ExecutionContext): Promise<boolean> {
     const isPublic = this.reflector.get<boolean>('public', context.getHandler());
     // check if IsPublic is used in api
-    if (isPublic || this.configService.get('COGNITO_BY_PASS') === 'true') {
+    if (isPublic || this.configService.get('COGNITO_BY_PASS') !== 'true') {
       // Allow public API access
       return true;

[NoCoverage] BooleanLiteral
src/middleware/AuthGuard.ts:20:14
     // check if IsPublic is used in api
     if (isPublic || this.configService.get('COGNITO_BY_PASS') === 'true') {
       // Allow public API access
-      return true;
+      return false;
     }
 

[NoCoverage] BlockStatement
src/middleware/AuthGuard.ts:26:17
     const request = context.switchToHttp().getRequest<Request>();
     const token = this.extractTokenFromHeader(request);
 
-    if (!token) {
-      throw new UnauthorizedException();
-    }
+    if (!token) {}
 
     try {

[NoCoverage] BlockStatement
src/middleware/AuthGuard.ts:30:9
       throw new UnauthorizedException();
     }
 
-    try {
-      const payload = await this.jwtCognito.verifyJwt(token);
-      request['email'] = payload.username.replace('azuread_', '');
-    } catch (error) {
+    try {} catch (error) {
       throw new UnauthorizedException(error);
     }

[NoCoverage] StringLiteral
src/middleware/AuthGuard.ts:32:51
 
     try {
       const payload = await this.jwtCognito.verifyJwt(token);
-      request['email'] = payload.username.replace('azuread_', '');
+      request['email'] = payload.username.replace("", '');
     } catch (error) {
       throw new UnauthorizedException(error);

[NoCoverage] BlockStatement
src/middleware/AuthGuard.ts:33:21
     try {
       const payload = await this.jwtCognito.verifyJwt(token);
       request['email'] = payload.username.replace('azuread_', '');
-    } catch (error) {
-      throw new UnauthorizedException(error);
-    }
+    } catch (error) {}
     return true;
   }

[NoCoverage] OptionalChaining
src/middleware/AuthGuard.ts:40:27
   }
 
   private extractTokenFromHeader(request: Request): string | undefined {
-    const [type, token] = request.headers.authorization?.split(' ') ?? [];
+    const [type, token] = request.headers.authorization.split(' ') ?? [];
     return type === 'Bearer' ? token : undefined;
   }

[NoCoverage] EqualityOperator
src/middleware/AuthGuard.ts:41:12
 
   private extractTokenFromHeader(request: Request): string | undefined {
     const [type, token] = request.headers.authorization?.split(' ') ?? [];
-    return type === 'Bearer' ? token : undefined;
+    return type !== 'Bearer' ? token : undefined;
   }
 }

[NoCoverage] ConditionalExpression
src/middleware/AuthGuard.ts:41:12
 
   private extractTokenFromHeader(request: Request): string | undefined {
     const [type, token] = request.headers.authorization?.split(' ') ?? [];
-    return type === 'Bearer' ? token : undefined;
+    return false ? token : undefined;
   }
 }
