[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:63:47
     }
   }
 
-  async deleteRole(id: string): Promise<void> {
-    try {
-      const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-
-      if (!role) {
-        throw new HttpException('Role not found', HttpStatus.NOT_FOUND);
-      }
-
-      await this.updateUsersWithRole(role as RoleDto);
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  async deleteRole(id: string): Promise<void> {}
 
   private async updateUsersWithRole(role: RoleDto): Promise<void> {

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:64:9
   }
 
   async deleteRole(id: string): Promise<void> {
-    try {
-      const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-
-      if (!role) {
-        throw new HttpException('Role not found', HttpStatus.NOT_FOUND);
-      }
-
-      await this.updateUsersWithRole(role as RoleDto);
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:67:18
     try {
       const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, id);
 
-      if (!role) {
-        throw new HttpException('Role not found', HttpStatus.NOT_FOUND);
-      }
+      if (!role) {}
 
       await this.updateUsersWithRole(role as RoleDto);
