[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:27:5
     private readonly stepService: StepService,
     private readonly mailerService: MailerService,
     private readonly logger: Logger,
-  ) {
-    this.md.core.ruler.after('normalize', 'variables', WelcomeService.markdownVariable);
-  }
+  ) {}
 
   static markdownVariable(state: StateCore) {

[Killed] StringLiteral
src/modules/welcome/welcome.service.ts:28:30
     private readonly mailerService: MailerService,
     private readonly logger: Logger,
   ) {
-    this.md.core.ruler.after('normalize', 'variables', WelcomeService.markdownVariable);
+    this.md.core.ruler.after("", 'variables', WelcomeService.markdownVariable);
   }
 
killedBy: UsersService createUser should create an user object and return an object
statusReason: Error: Parser rule not found:

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:31:45
     this.md.core.ruler.after('normalize', 'variables', WelcomeService.markdownVariable);
   }
 
-  static markdownVariable(state: StateCore) {
-    state.src = state.src.replaceAll(/{{\s?(\w+)\s?}}/g, (_, name) => state.env[name] || ''.padStart(name.length, '█'));
-  }
+  static markdownVariable(state: StateCore) {}
 
   async createUser(createUserDto: CreateUserDto): Promise<WelcomeUser> {

[NoCoverage] LogicalOperator
src/modules/welcome/welcome.service.ts:32:71
   }
 
   static markdownVariable(state: StateCore) {
-    state.src = state.src.replaceAll(/{{\s?(\w+)\s?}}/g, (_, name) => state.env[name] || ''.padStart(name.length, '█'));
+    state.src = state.src.replaceAll(/{{\s?(\w+)\s?}}/g, (_, name) => state.env[name] && ''.padStart(name.length, '█'));
   }
 

[Survived] ArrowFunction
src/modules/welcome/welcome.service.ts:32:58
   }
 
   static markdownVariable(state: StateCore) {
-    state.src = state.src.replaceAll(/{{\s?(\w+)\s?}}/g, (_, name) => state.env[name] || ''.padStart(name.length, '█'));
+    state.src = state.src.replaceAll(/{{\s?(\w+)\s?}}/g, () => undefined);
   }
 

[Survived] ConditionalExpression
src/modules/welcome/welcome.service.ts:38:11
   async createUser(createUserDto: CreateUserDto): Promise<WelcomeUser> {
     try {
       let id = uuidv4();
-      if (process.env.NODE_ENV === 'test') {
+      if (false) {
         id = 'test-integration';
       }

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:38:44
   async createUser(createUserDto: CreateUserDto): Promise<WelcomeUser> {
     try {
       let id = uuidv4();
-      if (process.env.NODE_ENV === 'test') {
-        id = 'test-integration';
-      }
+      if (process.env.NODE_ENV === 'test') {}
       const now = Timestamp.now();
       const dbUser: WelcomeUser = Object.assign(instanceToPlain(createUserDto) as CreateUserDto, {

[Survived] ArrowFunction
src/modules/welcome/welcome.service.ts:52:63
       });
 
       dbUser.steps.push(
-        ...(await this.stepService.generateSteps(dbUser)).map((s) => ({
-          _id: s.step._id,
-          unlockDate: Timestamp.fromDate(s.dt),
-          subStep: s.step.subStep,
-        })),
+        ...(await this.stepService.generateSteps(dbUser)).map(() => undefined),
       );
 

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:60:21
       );
 
       return (await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, dbUser)) as WelcomeUser;
-    } catch (error) {
-      if (error instanceof HttpException) {
-        this.logger.error(error);
-        throw error;
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
-    }
+    } catch (error) {}
   }
 

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:61:11
 
       return (await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, dbUser)) as WelcomeUser;
     } catch (error) {
-      if (error instanceof HttpException) {
+      if (false) {
         this.logger.error(error);
         throw error;
killedBy: UsersService createUser should throw a httpException error
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "exception error"
Received: "Internal Server Error"

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:61:11
 
       return (await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, dbUser)) as WelcomeUser;
     } catch (error) {
-      if (error instanceof HttpException) {
+      if (true) {
         this.logger.error(error);
         throw error;
killedBy: UsersService createUser should throw a InternalServer error
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InternalServerErrorException
Received constructor: Error

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:64:14
       if (error instanceof HttpException) {
         this.logger.error(error);
         throw error;
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
+      } else {}
     }
   }

[Survived] StringLiteral
src/modules/welcome/welcome.service.ts:72:23
 
   async findAll(filter: any): Promise<WelcomeUser[]> {
     try {
-      this.logger.log('[FindAllUsers] - find all users with filter : ', filter);
+      this.logger.log("", filter);
       return (
         await this.firestoreService.getAllDocuments<WelcomeUser>(FIRESTORE_COLLECTIONS.WELCOME_USERS, filter)

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:75:13
       this.logger.log('[FindAllUsers] - find all users with filter : ', filter);
       return (
         await this.firestoreService.getAllDocuments<WelcomeUser>(FIRESTORE_COLLECTIONS.WELCOME_USERS, filter)
-      ).map((u) => new WelcomeUser(u));
+      ).map(() => undefined);
     } catch (error) {
       if (error instanceof HttpException) {
killedBy: UsersService findAll should return a user array with no filters
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 70
+ Received  +  1

  Array [
-   Object {
-     "_id": "16156-585263",

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:76:21
       return (
         await this.firestoreService.getAllDocuments<WelcomeUser>(FIRESTORE_COLLECTIONS.WELCOME_USERS, filter)
       ).map((u) => new WelcomeUser(u));
-    } catch (error) {
-      if (error instanceof HttpException) {
-        this.logger.error(error);
-        throw error;
-      } else {
-        throw new InternalServerErrorException();
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:80:14
       if (error instanceof HttpException) {
         this.logger.error(error);
         throw error;
-      } else {
-        throw new InternalServerErrorException();
-      }
+      } else {}
     }
   }

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:91:21
       return new WelcomeUser(
         await this.firestoreService.getDocument<WelcomeUser>(FIRESTORE_COLLECTIONS.WELCOME_USERS, id),
       );
-    } catch (error) {
-      if (error instanceof HttpException) {
-        this.logger.error('User is not registered in welcome');
-        throw new HttpException('User is not registered in welcome', error.getStatus());
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] StringLiteral
src/modules/welcome/welcome.service.ts:93:27
       );
     } catch (error) {
       if (error instanceof HttpException) {
-        this.logger.error('User is not registered in welcome');
+        this.logger.error("");
         throw new HttpException('User is not registered in welcome', error.getStatus());
       } else {

[Killed] StringLiteral
src/modules/welcome/welcome.service.ts:94:33
     } catch (error) {
       if (error instanceof HttpException) {
         this.logger.error('User is not registered in welcome');
-        throw new HttpException('User is not registered in welcome', error.getStatus());
+        throw new HttpException("", error.getStatus());
       } else {
         throw new InternalServerErrorException('Internal Server Error');
killedBy: UsersService findOne should throw an error if the documentId doesn't exist
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "User is not registered in welcome"
Received: ""

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:95:14
       if (error instanceof HttpException) {
         this.logger.error('User is not registered in welcome');
         throw new HttpException('User is not registered in welcome', error.getStatus());
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
+      } else {}
     }
   }

[Survived] StringLiteral
src/modules/welcome/welcome.service.ts:96:48
         this.logger.error('User is not registered in welcome');
         throw new HttpException('User is not registered in welcome', error.getStatus());
       } else {
-        throw new InternalServerErrorException('Internal Server Error');
+        throw new InternalServerErrorException("");
       }
     }

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:101:43
     }
   }
 
-  async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    try {
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, id);
-    } catch (error) {
-      throw new InternalServerErrorException('Internal Server Error');
-    }
-  }
+  async remove(id: string): Promise<void> {}
 
   async update(id: string, updateUserDto: UpdateUserDto): Promise<WelcomeUser> {

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:103:9
 
   async remove(id: string): Promise<void> {
     await this.findOne(id);
-    try {
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, id);
-    } catch (error) {
+    try {} catch (error) {
       throw new InternalServerErrorException('Internal Server Error');
     }

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:105:21
     await this.findOne(id);
     try {
       await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, id);
-    } catch (error) {
-      throw new InternalServerErrorException('Internal Server Error');
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:112:9
 
   async update(id: string, updateUserDto: UpdateUserDto): Promise<WelcomeUser> {
     const userToUpdate = Object.assign(instanceToPlain(updateUserDto), { lastUpdate: Timestamp.now() });
-    try {
-      await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, id, userToUpdate);
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof HttpException) {
         this.logger.error(error);

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:114:21
     const userToUpdate = Object.assign(instanceToPlain(updateUserDto), { lastUpdate: Timestamp.now() });
     try {
       await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, id, userToUpdate);
-    } catch (error) {
-      if (error instanceof HttpException) {
-        this.logger.error(error);
-        throw error;
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
-    }
+    } catch (error) {}
     return await this.findOne(id);
   }

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:136:78
    * @param unlockedSteps - The list of steps to update
    * @returns The database result
    */
-  private async updateEmailSteps(user: WelcomeUser, unlockedSteps: string[]) {
-    const unlockEmailSentAt = Timestamp.now();
-    return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map((step) =>
-        unlockedSteps.includes(step._id) ? Object.assign(step, { unlockEmailSentAt }) : step,
-      ),
-    });
-  }
+  private async updateEmailSteps(user: WelcomeUser, unlockedSteps: string[]) {}
 
   /**

[Survived] ArrowFunction
src/modules/welcome/welcome.service.ts:139:29
   private async updateEmailSteps(user: WelcomeUser, unlockedSteps: string[]) {
     const unlockEmailSentAt = Timestamp.now();
     return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map((step) =>
-        unlockedSteps.includes(step._id) ? Object.assign(step, { unlockEmailSentAt }) : step,
+      steps: user.steps.map(() => undefined,
       ),
     });

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:154:42
   getNewlyUnlockedSteps(user: WelcomeUser, now: Date) {
     return user.steps
       ? user.steps.reduce((acc, step) => {
-          if (!step.unlockEmailSentAt && step.unlockDate.toDate() <= now) {
+          if (!step.unlockEmailSentAt && step.unlockDate.toDate() > now) {
             acc.push(step._id);
           }
killedBy: UsersService getNewlyUnlockedSteps should return unlocked steps (some steps)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 1

  Array [
-   "1",
-   "2",

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:154:75
   getNewlyUnlockedSteps(user: WelcomeUser, now: Date) {
     return user.steps
       ? user.steps.reduce((acc, step) => {
-          if (!step.unlockEmailSentAt && step.unlockDate.toDate() <= now) {
-            acc.push(step._id);
-          }
+          if (!step.unlockEmailSentAt && step.unlockDate.toDate() <= now) {}
           return acc;
         }, [] as string[])
killedBy: UsersService getNewlyUnlockedSteps should return unlocked steps (some steps)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   "1",
-   "2",

[Survived] StringLiteral
src/modules/welcome/welcome.service.ts:169:21
    * @returns List of email sent with status
    */
   async run(now: Date) {
-    this.logger.log('[Step] - send email to users');
+    this.logger.log("");
     const steps = await this.stepService.findAll();
     const users = await this.findAll(Filter.where('arrivalDate', '>', now.toISOString()));

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:175:20
     const userEmails = [];
     users.forEach((user) => {
       const unlockedSteps = this.getNewlyUnlockedSteps(user, now);
-      const step = unlockedSteps[0] !== undefined ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
+      const step = false ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
       if (step && step.unlockEmail) {
         userEmails.push(
killedBy: UsersService run should send emails to newcommers with unlocked steps (some users)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "status": "fulfilled",

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:175:20
     const userEmails = [];
     users.forEach((user) => {
       const unlockedSteps = this.getNewlyUnlockedSteps(user, now);
-      const step = unlockedSteps[0] !== undefined ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
+      const step = unlockedSteps[0] === undefined ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
       if (step && step.unlockEmail) {
         userEmails.push(
killedBy: UsersService run should send emails to newcommers with unlocked steps (some users)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "status": "fulfilled",

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:176:11
     users.forEach((user) => {
       const unlockedSteps = this.getNewlyUnlockedSteps(user, now);
       const step = unlockedSteps[0] !== undefined ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
-      if (step && step.unlockEmail) {
+      if (true) {
         userEmails.push(
           new Promise((resolve, reject) => {
killedBy: UsersService run should send emails to newcommers with unlocked steps (no user)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

- Array []
+ Array [
+   Object {

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:176:11
     users.forEach((user) => {
       const unlockedSteps = this.getNewlyUnlockedSteps(user, now);
       const step = unlockedSteps[0] !== undefined ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
-      if (step && step.unlockEmail) {
+      if (false) {
         userEmails.push(
           new Promise((resolve, reject) => {
killedBy: UsersService run should send emails to newcommers with unlocked steps (some users)
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 14
+ Received  +  1

- Array [
-   Object {
-     "status": "fulfilled",

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:178:44
       const step = unlockedSteps[0] !== undefined ? steps.find((step) => step._id === unlockedSteps[0]) : undefined;
       if (step && step.unlockEmail) {
         userEmails.push(
-          new Promise((resolve, reject) => {
-            this.mailerService
-              .sendMail({
-                to: user.email,
-                subject: step.unlockEmail.subject,
-                html: this.md.render(step.unlockEmail.body, {
-                  app_name: APP_NAME,
-                  app_url: APP_URL,
-                  user_firstName: user.firstName,
-                  user_lastName: user.lastName,
-                  manager_firstName: user.referentRH.firstName,
-                  manager_lastName: user.referentRH.lastName,
-                  step_id: step._id,
-                }),
-              })
-              .then(async () => {
-                await this.updateEmailSteps(user, unlockedSteps);
-                resolve({ _id: user._id });
-              })
-              .catch(({ message }) => reject({ _id: user._id, message }));
-          }),
+          new Promise((resolve, reject) => {}),
         );
       }
killedBy: UsersService run should send emails to newcommers with unlocked steps (some users)
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:193:33
                   step_id: step._id,
                 }),
               })
-              .then(async () => {
-                await this.updateEmailSteps(user, unlockedSteps);
-                resolve({ _id: user._id });
-              })
+              .then(async () => {})
               .catch(({ message }) => reject({ _id: user._id, message }));
           }),
killedBy: UsersService run should send emails to newcommers with unlocked steps (some users)
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:197:22
                 await this.updateEmailSteps(user, unlockedSteps);
                 resolve({ _id: user._id });
               })
-              .catch(({ message }) => reject({ _id: user._id, message }));
+              .catch(() => undefined);
           }),
         );
killedBy: UsersService run should return rejected when emails cannot be send
statusReason: Error: thrown: "Exceeded timeout of 5000 ms for a test.
Add a timeout value to this test to increase the timeout, if this is a long-running test. See https://jestjs.io/docs/api#testname-fn-timeout."

[Killed] ObjectLiteral
src/modules/welcome/welcome.service.ts:216:95
     const completedAt = Timestamp.fromDate(now);
     const user = await this.findOne(userId);
     const step = await this.stepService.findOne(stepId);
-    await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map((s) => (s._id === stepId ? Object.assign(s, { completedAt }) : s)),
-    });
+    await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {});
     if (step.completionEmailManager) {
       await this.mailerService.sendMail({
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "1",
- Object {

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:217:37
     const user = await this.findOne(userId);
     const step = await this.stepService.findOne(stepId);
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map((s) => (s._id === stepId ? Object.assign(s, { completedAt }) : s)),
+      steps: user.steps.map((s) => (true ? Object.assign(s, { completedAt }) : s)),
     });
     if (step.completionEmailManager) {
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "1",
  Object {

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:217:29
     const user = await this.findOne(userId);
     const step = await this.stepService.findOne(stepId);
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map((s) => (s._id === stepId ? Object.assign(s, { completedAt }) : s)),
+      steps: user.steps.map(() => undefined),
     });
     if (step.completionEmailManager) {
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "1",
  Object {

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:219:9
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
       steps: user.steps.map((s) => (s._id === stepId ? Object.assign(s, { completedAt }) : s)),
     });
-    if (step.completionEmailManager) {
+    if (false) {
       await this.mailerService.sendMail({
         to: user.referentRH.email,
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
- Expected
+ Received

  Object {
-   "html": "<p>12345</p>

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:219:38
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
       steps: user.steps.map((s) => (s._id === stepId ? Object.assign(s, { completedAt }) : s)),
     });
-    if (step.completionEmailManager) {
-      await this.mailerService.sendMail({
-        to: user.referentRH.email,
-        subject: step.completionEmailManager.subject,
-        html: this.md.render(step.completionEmailManager.body, {
-          app_name: APP_NAME,
-          app_url: APP_URL,
-          user_firstName: user.firstName,
-          user_lastName: user.lastName,
-          manager_firstName: user.referentRH.firstName,
-          manager_lastName: user.referentRH.lastName,
-          step_id: step._id,
-        }),
-      });
-    }
+    if (step.completionEmailManager) {}
     if (step.completionEmail) {
       await this.mailerService.sendMail({
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
- Expected
+ Received

  Object {
-   "html": "<p>12345</p>

[Killed] ObjectLiteral
src/modules/welcome/welcome.service.ts:220:41
       steps: user.steps.map((s) => (s._id === stepId ? Object.assign(s, { completedAt }) : s)),
     });
     if (step.completionEmailManager) {
-      await this.mailerService.sendMail({
-        to: user.referentRH.email,
-        subject: step.completionEmailManager.subject,
-        html: this.md.render(step.completionEmailManager.body, {
-          app_name: APP_NAME,
-          app_url: APP_URL,
-          user_firstName: user.firstName,
-          user_lastName: user.lastName,
-          manager_firstName: user.referentRH.firstName,
-          manager_lastName: user.referentRH.lastName,
-          step_id: step._id,
-        }),
-      });
+      await this.mailerService.sendMail({});
     }
     if (step.completionEmail) {
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 1
Expected: {"html": "<p>12345</p>
", "subject": "Test2", "to": "ccc.ddd@localhost"}
Received
->     1
        - Object {

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:234:9
         }),
       });
     }
-    if (step.completionEmail) {
+    if (false) {
       await this.mailerService.sendMail({
         to: user.email,
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: {"html": "<p>1234</p>
", "subject": "Test", "to": "aaa.bbb@localhost"}
Received
       1: {"html": "<p>12345</p>
", "subject": "Test2", "to": "ccc.ddd@localhost"}

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:234:31
         }),
       });
     }
-    if (step.completionEmail) {
-      await this.mailerService.sendMail({
-        to: user.email,
-        subject: step.completionEmail.subject,
-        html: this.md.render(step.completionEmail.body, {
-          app_name: APP_NAME,
-          app_url: APP_URL,
-          user_firstName: user.firstName,
-          user_lastName: user.lastName,
-          manager_firstName: user.referentRH.firstName,
-          manager_lastName: user.referentRH.lastName,
-          step_id: step._id,
-        }),
-      });
-    }
+    if (step.completionEmail) {}
     return { status: 'OK' };
   }
killedBy: UsersService completeStep should complete user step and send emails
statusReason: Error: expect(jest.fn()).toHaveBeenNthCalledWith(n, ...expected)

n: 2
Expected: {"html": "<p>1234</p>
", "subject": "Test", "to": "aaa.bbb@localhost"}
Received
       1: {"html": "<p>12345</p>
", "subject": "Test2", "to": "ccc.ddd@localhost"}
