[Survived] BlockStatement
src/modules/agencies/agencies.service.ts:19:73
     return await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, agencyDto);
   }
 
-  async createMany(createAgenciesDto: CreateAgencyDto[]): Promise<void> {
-    const agenciesDto = instanceToPlain(createAgenciesDto);
-    agenciesDto.map(async (agency) => {
-      const agencyDto: Record<string, any> = instanceToPlain(agency);
-      agencyDto._id = uuidv4();
-      await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, agencyDto);
-    });
-  }
+  async createMany(createAgenciesDto: CreateAgencyDto[]): Promise<void> {}
 
   async findAll(): Promise<Agency[]> {

[Survived] BlockStatement
src/modules/agencies/agencies.service.ts:21:39
 
   async createMany(createAgenciesDto: CreateAgencyDto[]): Promise<void> {
     const agenciesDto = instanceToPlain(createAgenciesDto);
-    agenciesDto.map(async (agency) => {
-      const agencyDto: Record<string, any> = instanceToPlain(agency);
-      agencyDto._id = uuidv4();
-      await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, agencyDto);
-    });
+    agenciesDto.map(async (agency) => {});
   }
 

[Survived] BlockStatement
src/modules/agencies/agencies.service.ts:37:43
     return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, id, updatedAgency);
   }
 
-  async remove(id: string): Promise<void> {
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, id);
-  }
+  async remove(id: string): Promise<void> {}
 }
 
