[Killed] BlockStatement
src/guards/jwt.guard.ts:29:25
 
   private static extractTokenFromHeader(request: Request): string | undefined {
     const { authorization } = request.headers;
-    if (!authorization) {
-      return;
-    }
+    if (!authorization) {}
     const [type, token] = authorization.split(" ") ?? [];
 
killedBy: JwtGuard canActivate should throw UnauthorizedException when token is missing.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: UnauthorizedException
Received constructor: TypeError

[Killed] BooleanLiteral
src/guards/jwt.guard.ts:29:9
 
   private static extractTokenFromHeader(request: Request): string | undefined {
     const { authorization } = request.headers;
-    if (!authorization) {
+    if (authorization) {
       return;
     }
killedBy: JwtGuard canActivate should throw UnauthorizedException when token is missing.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: UnauthorizedException
Received constructor: TypeError

[NoCoverage] ArrayDeclaration
src/guards/jwt.guard.ts:32:55
     if (!authorization) {
       return;
     }
-    const [type, token] = authorization.split(" ") ?? [];
+    const [type, token] = authorization.split(" ") ?? ["Stryker was here"];
 
     return type === "Bearer" ? token : undefined;

[Killed] EqualityOperator
src/guards/jwt.guard.ts:34:12
     }
     const [type, token] = authorization.split(" ") ?? [];
 
-    return type === "Bearer" ? token : undefined;
+    return type !== "Bearer" ? token : undefined;
   }
 
killedBy: JwtGuard canActivate should return true when Gip token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] ConditionalExpression
src/guards/jwt.guard.ts:34:12
     }
     const [type, token] = authorization.split(" ") ?? [];
 
-    return type === "Bearer" ? token : undefined;
+    return false ? token : undefined;
   }
 
killedBy: JwtGuard canActivate should return true when Gip token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] ConditionalExpression
src/guards/jwt.guard.ts:40:9
   public async canActivate(context: ExecutionContext): Promise<boolean> {
     const isPublic = this.reflector.get<boolean>(IS_PUBLIC_METADATA_SYMBOL, context.getHandler());
     const request = context.switchToHttp().getRequest<Request & UserRequest>();
-    if (isPublic) {
+    if (false) {
       return true;
     }
killedBy: JwtGuard canActivate should return true when decorator public is set.
statusReason: UnauthorizedException: Unauthorized

[Killed] BlockStatement
src/guards/jwt.guard.ts:40:19
   public async canActivate(context: ExecutionContext): Promise<boolean> {
     const isPublic = this.reflector.get<boolean>(IS_PUBLIC_METADATA_SYMBOL, context.getHandler());
     const request = context.switchToHttp().getRequest<Request & UserRequest>();
-    if (isPublic) {
-      return true;
-    }
+    if (isPublic) {}
     if (this.configService.get("BYPASS_GUARD") === "true") {
       request.user = {
killedBy: JwtGuard canActivate should return true when decorator public is set.
statusReason: UnauthorizedException: Unauthorized

[Killed] ConditionalExpression
src/guards/jwt.guard.ts:43:9
     if (isPublic) {
       return true;
     }
-    if (this.configService.get("BYPASS_GUARD") === "true") {
+    if (true) {
       request.user = {
         id: "bypass",
killedBy: JwtGuard canActivate should throw UnauthorizedException when token is missing.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/guards/jwt.guard.ts:43:60
     if (isPublic) {
       return true;
     }
-    if (this.configService.get("BYPASS_GUARD") === "true") {
-      request.user = {
-        id: "bypass",
-        email: "bypass@localhost",
-        role: Role.ADMIN,
-      };
-
-      return true;
-    }
+    if (this.configService.get("BYPASS_GUARD") === "true") {}
     const token = JwtGuard.extractTokenFromHeader(request);
     Object.assign(request, await this.verifyToken(token));
killedBy: JwtGuard canActivate should return true when BYPASS_GUARD is set.
statusReason: UnauthorizedException: Unauthorized

[Survived] StringLiteral
src/guards/jwt.guard.ts:46:16
     if (this.configService.get("BYPASS_GUARD") === "true") {
       request.user = {
         id: "bypass",
-        email: "bypass@localhost",
+        email: "",
         role: Role.ADMIN,
       };

[Killed] BooleanLiteral
src/guards/jwt.guard.ts:59:9
   }
 
   private async verifyToken(token: string): Promise<UserRequest> {
-    if (!token) {
+    if (token) {
       throw new UnauthorizedException();
     }
killedBy: JwtGuard canActivate should return true when Gip token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] ConditionalExpression
src/guards/jwt.guard.ts:59:9
   }
 
   private async verifyToken(token: string): Promise<UserRequest> {
-    if (!token) {
+    if (true) {
       throw new UnauthorizedException();
     }
killedBy: JwtGuard canActivate should return true when Gip token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] BlockStatement
src/guards/jwt.guard.ts:65:54
     try {
       const [, payloadStr] = token.split(".");
       const payload = JSON.parse(globalThis.atob(payloadStr)) as Record<string, unknown>;
-      if (payload.iss === this.gipService.issuerUrl) {
-        return await this.verifyGipToken(token);
-      }
+      if (payload.iss === this.gipService.issuerUrl) {}
       if (payload.iss === this.cognitoService.issuerUrl) {
         return await this.verifyCognitoToken(token);
killedBy: JwtGuard canActivate should return true when Gip token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] EqualityOperator
src/guards/jwt.guard.ts:65:11
     try {
       const [, payloadStr] = token.split(".");
       const payload = JSON.parse(globalThis.atob(payloadStr)) as Record<string, unknown>;
-      if (payload.iss === this.gipService.issuerUrl) {
+      if (payload.iss !== this.gipService.issuerUrl) {
         return await this.verifyGipToken(token);
       }
killedBy: JwtGuard canActivate should return true when Gip token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] EqualityOperator
src/guards/jwt.guard.ts:68:11
       if (payload.iss === this.gipService.issuerUrl) {
         return await this.verifyGipToken(token);
       }
-      if (payload.iss === this.cognitoService.issuerUrl) {
+      if (payload.iss !== this.cognitoService.issuerUrl) {
         return await this.verifyCognitoToken(token);
       }
killedBy: JwtGuard canActivate should return true when Cognito token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] ConditionalExpression
src/guards/jwt.guard.ts:68:11
       if (payload.iss === this.gipService.issuerUrl) {
         return await this.verifyGipToken(token);
       }
-      if (payload.iss === this.cognitoService.issuerUrl) {
+      if (false) {
         return await this.verifyCognitoToken(token);
       }
killedBy: JwtGuard canActivate should return true when Cognito token is valid.
statusReason: UnauthorizedException: Unauthorized

[Killed] BlockStatement
src/guards/jwt.guard.ts:72:13
         return await this.verifyCognitoToken(token);
       }
       throw new Error();
-    } catch {
-      throw new UnauthorizedException();
-    }
+    } catch {}
   }
 
killedBy: JwtGuard canActivate should throw UnauthorizedException when token is valid but has unknown issuer.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] ConditionalExpression
src/guards/jwt.guard.ts:95:16
     return {
       user: {
         id: payload.sub,
-        email: "username" in payload && typeof payload.username === "string" ? payload.username.replace("azuread_", "") : undefined,
+        email: true ? payload.username.replace("azuread_", "") : undefined,
         role: Role.ADMIN,
       },
killedBy: JwtGuard canActivate should return true when Cognito token is valid.
statusReason: UnauthorizedException: Unauthorized

[Survived] ConditionalExpression
src/guards/jwt.guard.ts:95:16
     return {
       user: {
         id: payload.sub,
-        email: "username" in payload && typeof payload.username === "string" ? payload.username.replace("azuread_", "") : undefined,
+        email: false ? payload.username.replace("azuread_", "") : undefined,
         role: Role.ADMIN,
       },
