[Killed] ConditionalExpression
src/guards/role.guard.ts:15:39
   ) { }
 
   private static haveRoles(requiredRoles: Role[], userRole: Role): boolean {
-    return requiredRoles.some(role => role === userRole);
+    return requiredRoles.some(role => false);
   }
 
killedBy: RoleGuard canActivate should return true when role required is in user role.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
src/guards/role.guard.ts:15:39
   ) { }
 
   private static haveRoles(requiredRoles: Role[], userRole: Role): boolean {
-    return requiredRoles.some(role => role === userRole);
+    return requiredRoles.some(role => true);
   }
 
killedBy: RoleGuard canActivate should return false when role required is not in user role.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
src/guards/role.guard.ts:19:9
   }
 
   public canActivate(context: ExecutionContext): boolean {
-    if (this.configService.get("BYPASS_GUARD") === "true") {
+    if (true) {
       return true;
     }
killedBy: RoleGuard canActivate should return false when role required is not in user role.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] EqualityOperator
src/guards/role.guard.ts:19:9
   }
 
   public canActivate(context: ExecutionContext): boolean {
-    if (this.configService.get("BYPASS_GUARD") === "true") {
+    if (this.configService.get("BYPASS_GUARD") !== "true") {
       return true;
     }
killedBy: RoleGuard canActivate should return false when role required is not in user role.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
src/guards/role.guard.ts:20:14
 
   public canActivate(context: ExecutionContext): boolean {
     if (this.configService.get("BYPASS_GUARD") === "true") {
-      return true;
+      return false;
     }
     const requiredRoles = this.reflector.get<Role[]>(ROLE_KEY, context.getHandler());
killedBy: RoleGuard canActivate should return true when BYPASS_GUARD is set.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] EqualityOperator
src/guards/role.guard.ts:23:9
       return true;
     }
     const requiredRoles = this.reflector.get<Role[]>(ROLE_KEY, context.getHandler());
-    if (requiredRoles === undefined) {
+    if (requiredRoles !== undefined) {
       return true;
     }
killedBy: RoleGuard canActivate should return true when no role required is set.
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] ConditionalExpression
src/guards/role.guard.ts:23:9
       return true;
     }
     const requiredRoles = this.reflector.get<Role[]>(ROLE_KEY, context.getHandler());
-    if (requiredRoles === undefined) {
+    if (false) {
       return true;
     }
killedBy: RoleGuard canActivate should return true when no role required is set.
statusReason: TypeError: Cannot read properties of undefined (reading 'some')

[Killed] BooleanLiteral
src/guards/role.guard.ts:24:14
     }
     const requiredRoles = this.reflector.get<Role[]>(ROLE_KEY, context.getHandler());
     if (requiredRoles === undefined) {
-      return true;
+      return false;
     }
     const { user } = context.switchToHttp().getRequest<UserRequest>();
killedBy: RoleGuard canActivate should return true when no role required is set.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
