[Survived] BlockStatement
src/modules/authentification/authentification.service.ts:16:53
     return await this.gipService.signInGIP(email, password);
   }
 
-  async signUp(signUpDto: SignupDto): Promise<void> {
-    const { email, password, copy_password } = signUpDto;
-    if (copy_password !== password) {
-      throw new BadRequestException('These passwords are not the same');
-    }
-    await this.gipService.signUpGIP(email, password);
-  }
+  async signUp(signUpDto: SignupDto): Promise<void> {}
 }
 

[Killed] ConditionalExpression
src/modules/authentification/authentification.service.ts:18:9
 
   async signUp(signUpDto: SignupDto): Promise<void> {
     const { email, password, copy_password } = signUpDto;
-    if (copy_password !== password) {
+    if (true) {
       throw new BadRequestException('These passwords are not the same');
     }
killedBy: AuthentificationService signupService should return a newly created user from firebase
statusReason: BadRequestException: These passwords are not the same

[Killed] EqualityOperator
src/modules/authentification/authentification.service.ts:18:9
 
   async signUp(signUpDto: SignupDto): Promise<void> {
     const { email, password, copy_password } = signUpDto;
-    if (copy_password !== password) {
+    if (copy_password === password) {
       throw new BadRequestException('These passwords are not the same');
     }
killedBy: AuthentificationService signupService should return a newly created user from firebase
statusReason: BadRequestException: These passwords are not the same
