[Killed] BlockStatement
src/modules/content/content.service.ts:15:72
 
   async create(createContentDto: CreateContentDto): Promise<ContentEntity> {
     const contentToCreate: Record<string, any> = instanceToPlain(createContentDto);
-    if (!contentToCreate || Object.keys(contentToCreate).length === 0) {
-      throw new BadRequestException('This content is empty');
-    }
+    if (!contentToCreate || Object.keys(contentToCreate).length === 0) {}
     contentToCreate._id = uuidv4();
     const content: ContentEntity = {
killedBy: ContentService should create a content with a empty object
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: BadRequestException
Received constructor: JestAssertionError

[Killed] StringLiteral
src/modules/content/content.service.ts:16:37
   async create(createContentDto: CreateContentDto): Promise<ContentEntity> {
     const contentToCreate: Record<string, any> = instanceToPlain(createContentDto);
     if (!contentToCreate || Object.keys(contentToCreate).length === 0) {
-      throw new BadRequestException('This content is empty');
+      throw new BadRequestException("");
     }
     contentToCreate._id = uuidv4();
killedBy: ContentService should create a content with a empty object
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "This content is empty"
Received: "Bad Request"
