[NoCoverage] BlockStatement
src/main.ts:15:55
 const DAY_IN_MS = 86400000;
 const DEFAULT_HTTP_PORT = 3337;
 
-const swaggerSetup = (app: INestApplication): void => {
-  const config = new DocumentBuilder()
-    .setTitle("Welcome Back")
-    .setDescription("API description")
-    .setVersion("0.0.1")
-    .addTag("Welcome")
-    .addBearerAuth({
-      description: "Token in format: Bearer &lt;JWT&gt;",
-      name: "Authorization",
-      bearerFormat: "Bearer",
-      scheme: "Bearer",
-      type: "http",
-      in: "Header",
-    })
-    .build();
-  const document = SwaggerModule.createDocument(app, config);
-  SwaggerModule.setup("swagger", app, document);
-};
+const swaggerSetup = (app: INestApplication): void => {};
 
 const bootstrap = async(): Promise<void> => {

[NoCoverage] StringLiteral
src/main.ts:18:21
 const swaggerSetup = (app: INestApplication): void => {
   const config = new DocumentBuilder()
     .setTitle("Welcome Back")
-    .setDescription("API description")
+    .setDescription("")
     .setVersion("0.0.1")
     .addTag("Welcome")

[NoCoverage] StringLiteral
src/main.ts:19:17
   const config = new DocumentBuilder()
     .setTitle("Welcome Back")
     .setDescription("API description")
-    .setVersion("0.0.1")
+    .setVersion("")
     .addTag("Welcome")
     .addBearerAuth({

[NoCoverage] StringLiteral
src/main.ts:25:15
       description: "Token in format: Bearer &lt;JWT&gt;",
       name: "Authorization",
       bearerFormat: "Bearer",
-      scheme: "Bearer",
+      scheme: "",
       type: "http",
       in: "Header",

[NoCoverage] StringLiteral
src/main.ts:27:11
       bearerFormat: "Bearer",
       scheme: "Bearer",
       type: "http",
-      in: "Header",
+      in: "",
     })
     .build();

[NoCoverage] LogicalOperator
src/main.ts:38:16
   const app = await NestFactory.create<NestExpressApplication>(AppModule);
   const MemoryStore = memoryStore(session);
   const configService = app.get<ConfigService>(ConfigService);
-  const port = Number(configService.get("PORT")) || DEFAULT_HTTP_PORT;
+  const port = Number(configService.get("PORT")) && DEFAULT_HTTP_PORT;
 
   app.set("trust proxy", true);

[NoCoverage] StringLiteral
src/main.ts:38:41
   const app = await NestFactory.create<NestExpressApplication>(AppModule);
   const MemoryStore = memoryStore(session);
   const configService = app.get<ConfigService>(ConfigService);
-  const port = Number(configService.get("PORT")) || DEFAULT_HTTP_PORT;
+  const port = Number(configService.get("")) || DEFAULT_HTTP_PORT;
 
   app.set("trust proxy", true);

[NoCoverage] BooleanLiteral
src/main.ts:40:26
   const configService = app.get<ConfigService>(ConfigService);
   const port = Number(configService.get("PORT")) || DEFAULT_HTTP_PORT;
 
-  app.set("trust proxy", true);
+  app.set("trust proxy", false);
   app.setGlobalPrefix("api");
   app.use(cookieParser());

[NoCoverage] BooleanLiteral
src/main.ts:44:60
   app.setGlobalPrefix("api");
   app.use(cookieParser());
   app.use(session({
-    cookie: { maxAge: DAY_IN_MS, sameSite: "none", secure: true },
+    cookie: { maxAge: DAY_IN_MS, sameSite: "none", secure: false },
     secret: configService.get("SESSION_SECRET"),
     store: new MemoryStore({ checkPeriod: DAY_IN_MS }),

[NoCoverage] ObjectLiteral
src/main.ts:44:13
   app.setGlobalPrefix("api");
   app.use(cookieParser());
   app.use(session({
-    cookie: { maxAge: DAY_IN_MS, sameSite: "none", secure: true },
+    cookie: {},
     secret: configService.get("SESSION_SECRET"),
     store: new MemoryStore({ checkPeriod: DAY_IN_MS }),

[NoCoverage] ObjectLiteral
src/main.ts:46:28
   app.use(session({
     cookie: { maxAge: DAY_IN_MS, sameSite: "none", secure: true },
     secret: configService.get("SESSION_SECRET"),
-    store: new MemoryStore({ checkPeriod: DAY_IN_MS }),
+    store: new MemoryStore({}),
     resave: false,
     saveUninitialized: false,

[NoCoverage] BooleanLiteral
src/main.ts:47:13
     cookie: { maxAge: DAY_IN_MS, sameSite: "none", secure: true },
     secret: configService.get("SESSION_SECRET"),
     store: new MemoryStore({ checkPeriod: DAY_IN_MS }),
-    resave: false,
+    resave: true,
     saveUninitialized: false,
   }));

[NoCoverage] BooleanLiteral
src/main.ts:48:24
     secret: configService.get("SESSION_SECRET"),
     store: new MemoryStore({ checkPeriod: DAY_IN_MS }),
     resave: false,
-    saveUninitialized: false,
+    saveUninitialized: true,
   }));
   app.enableCors({ origin: [configService.get("HUB_FRONT_URL")], credentials: true });

[NoCoverage] BooleanLiteral
src/main.ts:50:79
     resave: false,
     saveUninitialized: false,
   }));
-  app.enableCors({ origin: [configService.get("HUB_FRONT_URL")], credentials: true });
+  app.enableCors({ origin: [configService.get("HUB_FRONT_URL")], credentials: false });
 
   swaggerSetup(app);

[NoCoverage] StringLiteral
src/main.ts:50:47
     resave: false,
     saveUninitialized: false,
   }));
-  app.enableCors({ origin: [configService.get("HUB_FRONT_URL")], credentials: true });
+  app.enableCors({ origin: [configService.get("")], credentials: true });
 
   swaggerSetup(app);

[NoCoverage] BooleanLiteral
src/main.ts:56:16
 
   // validation Pipes
   app.useGlobalPipes(new ValidationPipe({
-    transform: true,
+    transform: false,
     disableErrorMessages: false,
     validationError: { target: false, value: true },

[NoCoverage] StringLiteral
src/main.ts:63:14
   }));
 
   await app.listen(port);
-  Logger.log(`Application running on port ${port}`);
+  Logger.log(``);
 };
 

[NoCoverage] BlockStatement
src/main.ts:66:14
   Logger.log(`Application running on port ${port}`);
 };
 
-((): void => {
-  bootstrap().catch((err: unknown) => {
-    Logger.error(err);
-  });
-})();
+((): void => {})();

[NoCoverage] BlockStatement
src/main.ts:67:39
 };
 
 ((): void => {
-  bootstrap().catch((err: unknown) => {
-    Logger.error(err);
-  });
+  bootstrap().catch((err: unknown) => {});
 })();
