[Survived] BlockStatement
src/modules/auth/auth.service.ts:17:69
 
   private readonly redirectUrl: string;
 
-  public constructor(private readonly configService: ConfigService) {
-    this.redirectUrl = `${this.configService.get("HUB_FRONT_URL")}/auth/callback`;
-  }
+  public constructor(private readonly configService: ConfigService) {}
 
   public async getAuthorizationUrl(): Promise<AuthorizationUrl> {

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:26:54
     const nonce = generators.nonce();
     const state = generators.state();
 
-    const authorizationUrl = client.authorizationUrl({
-      scope: "openid email",
-      nonce,
-      state,
-    });
+    const authorizationUrl = client.authorizationUrl({});
 
     return { authorizationUrl, nonce, state };

[Survived] StringLiteral
src/modules/auth/auth.service.ts:27:14
     const state = generators.state();
 
     const authorizationUrl = client.authorizationUrl({
-      scope: "openid email",
+      scope: "",
       nonce,
       state,

[Survived] ObjectLiteral
src/modules/auth/auth.service.ts:40:9
     try {
       return await client.callback(
         this.redirectUrl,
-        { code, state },
+        {},
         { response_type: "code", nonce, state },
       );

[Killed] BlockStatement
src/modules/auth/auth.service.ts:43:19
         { code, state },
         { response_type: "code", nonce, state },
       );
-    } catch (err) {
-      if (err instanceof Error) {
-        throw new BadRequestException(err.message);
-      }
-    }
+    } catch (err) {}
   }
 
killedBy: AuthService handleCallback should throw when handleCallback fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/modules/auth/auth.service.ts:44:33
         { response_type: "code", nonce, state },
       );
     } catch (err) {
-      if (err instanceof Error) {
-        throw new BadRequestException(err.message);
-      }
+      if (err instanceof Error) {}
     }
   }
killedBy: AuthService handleCallback should throw when handleCallback fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/modules/auth/auth.service.ts:54:19
     const client = await this.getClient();
     try {
       return await client.refresh(token);
-    } catch (err) {
-      if (err instanceof Error) {
-        throw new BadRequestException(err.message);
-      }
-    }
+    } catch (err) {}
   }
 
killedBy: AuthService refresh should throw when refresh fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] ConditionalExpression
src/modules/auth/auth.service.ts:62:9
   }
 
   private async getClient(): Promise<BaseClient> {
-    if (this.client === null) {
+    if (false) {
       try {
killedBy: AuthService getAuthorizationUrl should return authorization url object when getAuthorizationUrl is called.
statusReason: TypeError: Cannot read properties of null (reading 'authorizationUrl')

[Killed] EqualityOperator
src/modules/auth/auth.service.ts:62:9
   }
 
   private async getClient(): Promise<BaseClient> {
-    if (this.client === null) {
+    if (this.client !== null) {
       try {
killedBy: AuthService getAuthorizationUrl should return authorization url object when getAuthorizationUrl is called.
statusReason: TypeError: Cannot read properties of null (reading 'authorizationUrl')

[Survived] ArrayDeclaration
src/modules/auth/auth.service.ts:68:26
         this.client = new cognitoIssuer.Client({
           client_id: this.configService.get("COGNITO_CLIENT_ID"),
           client_secret: this.configService.get("COGNITO_CLIENT_SECRET"),
-          redirect_uris: [this.redirectUrl],
+          redirect_uris: [],
           response_types: ["code"],
         });

[Survived] ArrayDeclaration
src/modules/auth/auth.service.ts:69:27
           client_id: this.configService.get("COGNITO_CLIENT_ID"),
           client_secret: this.configService.get("COGNITO_CLIENT_SECRET"),
           redirect_uris: [this.redirectUrl],
-          response_types: ["code"],
+          response_types: [],
         });
       } catch (err) {

[NoCoverage] BlockStatement
src/modules/auth/auth.service.ts:71:21
           redirect_uris: [this.redirectUrl],
           response_types: ["code"],
         });
-      } catch (err) {
-        if (err instanceof Error) {
-          throw new InternalServerErrorException(err.message);
-        }
-      }
+      } catch (err) {}
     }
     return this.client;

[NoCoverage] ConditionalExpression
src/modules/auth/auth.service.ts:72:13
           response_types: ["code"],
         });
       } catch (err) {
-        if (err instanceof Error) {
+        if (true) {
           throw new InternalServerErrorException(err.message);
         }
