[Survived] BlockStatement
src/modules/members/members.service.ts:20:71
     return await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, memberDto);
   }
 
-  async createMany(createMemberDto: CreateMemberDto[]): Promise<void> {
-    const membersDto = instanceToPlain(createMemberDto);
-    membersDto.map(async (member: any) => {
-      const memberDto: Record<string, any> = instanceToPlain(member);
-      memberDto._id = uuidv4();
-      await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, memberDto);
-    });
-  }
+  async createMany(createMemberDto: CreateMemberDto[]): Promise<void> {}
 
   async findAll(): Promise<Member[]> {

[Survived] BlockStatement
src/modules/members/members.service.ts:22:43
 
   async createMany(createMemberDto: CreateMemberDto[]): Promise<void> {
     const membersDto = instanceToPlain(createMemberDto);
-    membersDto.map(async (member: any) => {
-      const memberDto: Record<string, any> = instanceToPlain(member);
-      memberDto._id = uuidv4();
-      await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, memberDto);
-    });
+    membersDto.map(async (member: any) => {});
   }
 

[Survived] BlockStatement
src/modules/members/members.service.ts:38:43
     return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, id, updatedMember);
   }
 
-  async remove(id: string): Promise<void> {
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, id);
-  }
+  async remove(id: string): Promise<void> {}
 }
 
