[Survived] BlockStatement
src/modules/step/step.service.ts:22:21
         FIRESTORE_COLLECTIONS.STEPS,
         instanceToPlain(createStepDto),
       )) as Step;
-    } catch (error) {
-      if (error instanceof HttpException) {
-        throw error;
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/modules/step/step.service.ts:34:21
   async findAll(): Promise<Step[]> {
     try {
       return await this.firestoreService.getAllDocuments<Step>(FIRESTORE_COLLECTIONS.STEPS);
-    } catch (error) {
-      if (error instanceof HttpException) {
-        throw error;
-      } else {
-        throw new InternalServerErrorException();
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/modules/step/step.service.ts:46:21
   async findOne(id: string): Promise<Step> {
     try {
       return await this.firestoreService.getDocument<Step>(FIRESTORE_COLLECTIONS.STEPS, id);
-    } catch (error) {
-      if (error instanceof HttpException) {
-        throw new HttpException('Step does not exists', error.getStatus());
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/modules/step/step.service.ts:49:14
     } catch (error) {
       if (error instanceof HttpException) {
         throw new HttpException('Step does not exists', error.getStatus());
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
+      } else {}
     }
   }

[Survived] BlockStatement
src/modules/step/step.service.ts:58:9
   async update(id: string, updateStepDto: UpdateStepDto): Promise<Step> {
     await this.findOne(id);
     const stepToUpdate: Record<string, any> = instanceToPlain(updateStepDto);
-    try {
-      await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.STEPS, id, stepToUpdate);
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof HttpException) {
         throw error;

[Survived] BlockStatement
src/modules/step/step.service.ts:60:21
     const stepToUpdate: Record<string, any> = instanceToPlain(updateStepDto);
     try {
       await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.STEPS, id, stepToUpdate);
-    } catch (error) {
-      if (error instanceof HttpException) {
-        throw error;
-      } else {
-        throw new InternalServerErrorException('Internal Server Error');
-      }
-    }
+    } catch (error) {}
     return await this.findOne(id);
   }

[Survived] BlockStatement
src/modules/step/step.service.ts:70:43
     return await this.findOne(id);
   }
 
-  async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    try {
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.STEPS, id);
-    } catch (error) {
-      throw new InternalServerErrorException('Internal Server Error');
-    }
-  }
+  async remove(id: string): Promise<void> {}
 
   /**

[Survived] BlockStatement
src/modules/step/step.service.ts:72:9
 
   async remove(id: string): Promise<void> {
     await this.findOne(id);
-    try {
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.STEPS, id);
-    } catch (error) {
+    try {} catch (error) {
       throw new InternalServerErrorException('Internal Server Error');
     }

[Survived] BlockStatement
src/modules/step/step.service.ts:74:21
     await this.findOne(id);
     try {
       await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.STEPS, id);
-    } catch (error) {
-      throw new InternalServerErrorException('Internal Server Error');
-    }
+    } catch (error) {}
   }
 

[Survived] BlockStatement
src/modules/step/step.service.ts:88:21
     try {
       const steps = await this.findAll();
       return generateStepDates(new Date(user.signupDate), new Date(user.arrivalDate), steps, HOLIDAY_COUNTRY);
-    } catch (error) {
-      throw new InternalServerErrorException('Internal Server Error');
-    }
+    } catch (error) {}
   }
 }

[Survived] StringLiteral
src/modules/step/step.service.ts:89:46
       const steps = await this.findAll();
       return generateStepDates(new Date(user.signupDate), new Date(user.arrivalDate), steps, HOLIDAY_COUNTRY);
     } catch (error) {
-      throw new InternalServerErrorException('Internal Server Error');
+      throw new InternalServerErrorException("");
     }
   }
