[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:23:21
       const roles = await this.firestoreService.getAllDocuments(FIRESTORE_COLLECTIONS.ROLES, filter);
 
       return roles as Role[];
-    } catch (error) {
-      this.logger.error(error);
-      throw new Error(`Error fetching roles: ${error.message}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:34:21
       const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, roleId);
 
       return role as Role;
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:40:50
     }
   }
 
-  async createRole(payload: CreateUpdateRoleDto) {
-    try {
-      const now = FieldValue.serverTimestamp();
-      const dataToSave = { ...payload, createdAt: now, updatedAt: now };
-
-      return await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.ROLES, dataToSave);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  async createRole(payload: CreateUpdateRoleDto) {}
 
   async updateRole(id: string, roleDto: RoleDto) {

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:41:9
   }
 
   async createRole(payload: CreateUpdateRoleDto) {
-    try {
-      const now = FieldValue.serverTimestamp();
-      const dataToSave = { ...payload, createdAt: now, updatedAt: now };
-
-      return await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.ROLES, dataToSave);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:46:21
       const dataToSave = { ...payload, createdAt: now, updatedAt: now };
 
       return await this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.ROLES, dataToSave);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:52:50
     }
   }
 
-  async updateRole(id: string, roleDto: RoleDto) {
-    try {
-      const now = FieldValue.serverTimestamp();
-      const dataToUpdate = { ...roleDto, updatedAt: now };
-
-      return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.ROLES, id, dataToUpdate);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  async updateRole(id: string, roleDto: RoleDto) {}
 
   async deleteRole(id: string): Promise<void> {

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:53:9
   }
 
   async updateRole(id: string, roleDto: RoleDto) {
-    try {
-      const now = FieldValue.serverTimestamp();
-      const dataToUpdate = { ...roleDto, updatedAt: now };
-
-      return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.ROLES, id, dataToUpdate);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:58:21
       const dataToUpdate = { ...roleDto, updatedAt: now };
 
       return await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.ROLES, id, dataToUpdate);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:64:47
     }
   }
 
-  async deleteRole(id: string): Promise<void> {
-    try {
-      const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-
-      if (!role) {
-        throw new HttpException("Role not found", HttpStatus.NOT_FOUND);
-      }
-
-      await this.updateUsersWithRole(role as RoleDto);
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  async deleteRole(id: string): Promise<void> {}
 
   private async updateUsersWithRole(role: RoleDto): Promise<void> {

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:65:9
   }
 
   async deleteRole(id: string): Promise<void> {
-    try {
-      const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-
-      if (!role) {
-        throw new HttpException("Role not found", HttpStatus.NOT_FOUND);
-      }
-
-      await this.updateUsersWithRole(role as RoleDto);
-      await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[NoCoverage] BooleanLiteral
src/modules/authorization/authorization.service.ts:68:11
     try {
       const role = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.ROLES, id);
 
-      if (!role) {
+      if (role) {
         throw new HttpException("Role not found", HttpStatus.NOT_FOUND);
       }

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:74:21
 
       await this.updateUsersWithRole(role as RoleDto);
       await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.ROLES, id);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:80:67
     }
   }
 
-  private async updateUsersWithRole(role: RoleDto): Promise<void> {
-    try {
-      const updateQuery = { [role.app]: role.name };
-      const updateData = { [role.app]: UserRoles.Collaborateur };
-
-      await this.firestoreService.updateManyDocuments(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, updateQuery, updateData);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  private async updateUsersWithRole(role: RoleDto): Promise<void> {}
 
   async getAllUsers(): Promise<User[]> {

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:81:9
   }
 
   private async updateUsersWithRole(role: RoleDto): Promise<void> {
-    try {
-      const updateQuery = { [role.app]: role.name };
-      const updateData = { [role.app]: UserRoles.Collaborateur };
-
-      await this.firestoreService.updateManyDocuments(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, updateQuery, updateData);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[NoCoverage] ObjectLiteral
src/modules/authorization/authorization.service.ts:82:27
 
   private async updateUsersWithRole(role: RoleDto): Promise<void> {
     try {
-      const updateQuery = { [role.app]: role.name };
+      const updateQuery = {};
       const updateData = { [role.app]: UserRoles.Collaborateur };
 

[NoCoverage] ObjectLiteral
src/modules/authorization/authorization.service.ts:83:26
   private async updateUsersWithRole(role: RoleDto): Promise<void> {
     try {
       const updateQuery = { [role.app]: role.name };
-      const updateData = { [role.app]: UserRoles.Collaborateur };
+      const updateData = {};
 
       await this.firestoreService.updateManyDocuments(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, updateQuery, updateData);

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:86:21
       const updateData = { [role.app]: UserRoles.Collaborateur };
 
       await this.firestoreService.updateManyDocuments(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, updateQuery, updateData);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:99:21
       const users = authUsers;
 
       return users as User[];
-    } catch (error) {
-      this.logger.error(error);
-      throw new Error(`Error fetching users: ${error.message}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] StringLiteral
src/modules/authorization/authorization.service.ts:101:23
       return users as User[];
     } catch (error) {
       this.logger.error(error);
-      throw new Error(`Error fetching users: ${error.message}`);
+      throw new Error(``);
     }
   }

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:110:21
       const authUser = await this.firestoreService.getDocument(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, id);
 
       return authUser as User;
-    } catch (error) {
-      this.logger.error(error);
-      throw new Error(`User not found: ${error.message}`);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:116:62
     }
   }
 
-  async updateUser(id: string, data: UserDto): Promise<void> {
-    try {
-      const now = FieldValue.serverTimestamp();
-      const dataToUpdate = { ...data, updatedAt: now };
-
-      await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, id, dataToUpdate);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  async updateUser(id: string, data: UserDto): Promise<void> {}
 }

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:117:9
   }
 
   async updateUser(id: string, data: UserDto): Promise<void> {
-    try {
-      const now = FieldValue.serverTimestamp();
-      const dataToUpdate = { ...data, updatedAt: now };
-
-      await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, id, dataToUpdate);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[NoCoverage] BlockStatement
src/modules/authorization/authorization.service.ts:122:21
       const dataToUpdate = { ...data, updatedAt: now };
 
       await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.AUTHORIZED_USERS, id, dataToUpdate);
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 }
