[NoCoverage] BlockStatement
src/utils/accessSecret.ts:4:42
 import { SecretManagerServiceClient } from '@google-cloud/secret-manager';
 import { Storage } from '@google-cloud/storage';
 
-export async function accessAllSecrets() {
-  let client = new SecretManagerServiceClient();
-  if (process.env.NODE_ENV === 'docker') {
-    client = new SecretManagerServiceClient({
-      authClient: await authenticateImplicitWithAdc(),
-    });
-  }
-  const parent = process.env.NAME_PROJECT;
-  const [secrets] = await client.listSecrets({
-    parent: parent,
-  });
-  for await (const secret of secrets) {
-    const [version] = await client.accessSecretVersion({
-      name: secret.name + '/versions/latest',
-    });
-    const parts = secret.name.split('/');
-    process.env[parts.pop()] = version.payload.data.toString();
-  }
-}
+export async function accessAllSecrets() {}
 
 async function authenticateImplicitWithAdc() {

[NoCoverage] EqualityOperator
src/utils/accessSecret.ts:6:7
 
 export async function accessAllSecrets() {
   let client = new SecretManagerServiceClient();
-  if (process.env.NODE_ENV === 'docker') {
+  if (process.env.NODE_ENV !== 'docker') {
     client = new SecretManagerServiceClient({
       authClient: await authenticateImplicitWithAdc(),

[NoCoverage] ConditionalExpression
src/utils/accessSecret.ts:6:7
 
 export async function accessAllSecrets() {
   let client = new SecretManagerServiceClient();
-  if (process.env.NODE_ENV === 'docker') {
+  if (true) {
     client = new SecretManagerServiceClient({
       authClient: await authenticateImplicitWithAdc(),

[NoCoverage] BlockStatement
src/utils/accessSecret.ts:15:39
   const [secrets] = await client.listSecrets({
     parent: parent,
   });
-  for await (const secret of secrets) {
-    const [version] = await client.accessSecretVersion({
-      name: secret.name + '/versions/latest',
-    });
-    const parts = secret.name.split('/');
-    process.env[parts.pop()] = version.payload.data.toString();
-  }
+  for await (const secret of secrets) {}
 }
 

[NoCoverage] ObjectLiteral
src/utils/accessSecret.ts:25:31
 }
 
 async function authenticateImplicitWithAdc() {
-  const storage = new Storage({
-    projectId: process.env.PROJECT_ID,
-    keyFilename: 'keyFileName/name-key-file.json',
-  });
+  const storage = new Storage({});
   const [buckets] = await storage.getBuckets({ maxResults: 1 });
   return buckets[0].parent['authClient']['cachedCredential'];

[NoCoverage] StringLiteral
src/utils/accessSecret.ts:27:18
 async function authenticateImplicitWithAdc() {
   const storage = new Storage({
     projectId: process.env.PROJECT_ID,
-    keyFilename: 'keyFileName/name-key-file.json',
+    keyFilename: "",
   });
   const [buckets] = await storage.getBuckets({ maxResults: 1 });

[NoCoverage] ObjectLiteral
src/utils/accessSecret.ts:29:46
     projectId: process.env.PROJECT_ID,
     keyFilename: 'keyFileName/name-key-file.json',
   });
-  const [buckets] = await storage.getBuckets({ maxResults: 1 });
+  const [buckets] = await storage.getBuckets({});
   return buckets[0].parent['authClient']['cachedCredential'];
 }

[NoCoverage] StringLiteral
src/utils/accessSecret.ts:30:42
     keyFilename: 'keyFileName/name-key-file.json',
   });
   const [buckets] = await storage.getBuckets({ maxResults: 1 });
-  return buckets[0].parent['authClient']['cachedCredential'];
+  return buckets[0].parent['authClient'][""];
 }
 
