[NoCoverage] BooleanLiteral
src/main.ts:42:18
   // Validation Pipes
   app.useGlobalPipes(
     new ValidationPipe({
-      transform: true,
+      transform: false,
       disableErrorMessages: false,
       validationError: { target: false, value: true },

[NoCoverage] BooleanLiteral
src/main.ts:43:29
   app.useGlobalPipes(
     new ValidationPipe({
       transform: true,
-      disableErrorMessages: false,
+      disableErrorMessages: true,
       validationError: { target: false, value: true },
       whitelist: true,

[NoCoverage] BooleanLiteral
src/main.ts:44:48
     new ValidationPipe({
       transform: true,
       disableErrorMessages: false,
-      validationError: { target: false, value: true },
+      validationError: { target: false, value: false },
       whitelist: true,
     }),

[NoCoverage] BooleanLiteral
src/main.ts:44:34
     new ValidationPipe({
       transform: true,
       disableErrorMessages: false,
-      validationError: { target: false, value: true },
+      validationError: { target: true, value: true },
       whitelist: true,
     }),

[NoCoverage] BooleanLiteral
src/main.ts:45:18
       transform: true,
       disableErrorMessages: false,
       validationError: { target: false, value: true },
-      whitelist: true,
+      whitelist: false,
     }),
   );

[NoCoverage] LogicalOperator
src/main.ts:49:20
     }),
   );
 
-  await app.listen(process.env.PORT || DEFAULT_HTTP_PORT);
+  await app.listen(process.env.PORT && DEFAULT_HTTP_PORT);
   logger.log(`Application running on port ${process.env.PORT || DEFAULT_HTTP_PORT}`);
 }

[NoCoverage] ConditionalExpression
src/main.ts:50:45
   );
 
   await app.listen(process.env.PORT || DEFAULT_HTTP_PORT);
-  logger.log(`Application running on port ${process.env.PORT || DEFAULT_HTTP_PORT}`);
+  logger.log(`Application running on port ${false}`);
 }
 

[NoCoverage] ConditionalExpression
src/main.ts:50:45
   );
 
   await app.listen(process.env.PORT || DEFAULT_HTTP_PORT);
-  logger.log(`Application running on port ${process.env.PORT || DEFAULT_HTTP_PORT}`);
+  logger.log(`Application running on port ${true}`);
 }
 
