[Survived] BlockStatement
modules/welcome/pipes/find-all-users.pipe.ts:6:31
 
 @Injectable()
 export class FindAllUsersPipe implements PipeTransform {
-  transform(arrivalDate: any) {
-    const filters = [];
-    if (!arrivalDate) {
-      return filters;
-    }
-    if (arrivalDate.startDate) {
-      filters.push(Filter.where('arrivalDate', '>=', arrivalDate.startDate));
-    }
-    if (arrivalDate.endDate) {
-      filters.push(Filter.where('arrivalDate', '<', arrivalDate.endDate));
-    }
-    return Filter.and(...filters);
-  }
+  transform(arrivalDate: any) {}
 }
 

[NoCoverage] BlockStatement
modules/welcome/pipes/find-all-users.pipe.ts:8:23
 export class FindAllUsersPipe implements PipeTransform {
   transform(arrivalDate: any) {
     const filters = [];
-    if (!arrivalDate) {
-      return filters;
-    }
+    if (!arrivalDate) {}
     if (arrivalDate.startDate) {
       filters.push(Filter.where('arrivalDate', '>=', arrivalDate.startDate));

[Survived] ConditionalExpression
modules/welcome/pipes/find-all-users.pipe.ts:8:9
 export class FindAllUsersPipe implements PipeTransform {
   transform(arrivalDate: any) {
     const filters = [];
-    if (!arrivalDate) {
+    if (false) {
       return filters;
     }

[Survived] BlockStatement
modules/welcome/pipes/find-all-users.pipe.ts:11:32
     if (!arrivalDate) {
       return filters;
     }
-    if (arrivalDate.startDate) {
-      filters.push(Filter.where('arrivalDate', '>=', arrivalDate.startDate));
-    }
+    if (arrivalDate.startDate) {}
     if (arrivalDate.endDate) {
       filters.push(Filter.where('arrivalDate', '<', arrivalDate.endDate));

[Survived] ConditionalExpression
modules/welcome/pipes/find-all-users.pipe.ts:11:9
     if (!arrivalDate) {
       return filters;
     }
-    if (arrivalDate.startDate) {
+    if (false) {
       filters.push(Filter.where('arrivalDate', '>=', arrivalDate.startDate));
     }

[Survived] ConditionalExpression
modules/welcome/pipes/find-all-users.pipe.ts:14:9
     if (arrivalDate.startDate) {
       filters.push(Filter.where('arrivalDate', '>=', arrivalDate.startDate));
     }
-    if (arrivalDate.endDate) {
+    if (false) {
       filters.push(Filter.where('arrivalDate', '<', arrivalDate.endDate));
     }

[Survived] BlockStatement
modules/welcome/pipes/find-all-users.pipe.ts:14:30
     if (arrivalDate.startDate) {
       filters.push(Filter.where('arrivalDate', '>=', arrivalDate.startDate));
     }
-    if (arrivalDate.endDate) {
-      filters.push(Filter.where('arrivalDate', '<', arrivalDate.endDate));
-    }
+    if (arrivalDate.endDate) {}
     return Filter.and(...filters);
   }
