[Killed] BlockStatement
modules/welcome/filters/create-user.filter.ts:6:56
 
 @Catch(HttpException)
 export class CreateUserExceptionFilter implements ExceptionFilter {
-  catch(exception: HttpException, host: ArgumentsHost) {
-    const ctx = host.switchToHttp();
-    const response = ctx.getResponse<Response>();
-    const res: string | object = exception.getResponse();
-    const status: number = exception.getStatus();
-
-    const message = 'At least one attribute is missing or not correct';
-
-    response.status(status).json({
-      statusCode: status,
-      message: message,
-      error: res,
-    });
-  }
+  catch(exception: HttpException, host: ArgumentsHost) {}
 }
 
killedBy: Welcome controller findAll should testing the create-user filter
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
