[Killed] BlockStatement
src/services/gip/gip.service.ts:23:5
     private readonly configService: ConfigService,
     private readonly logger: Logger,
     private readonly firestoreService: FirestoreService,
-  ) {
-    this.firebaseConfig = {
-      apiKey: this.configService.get('API_KEY'),
-      authDomain: this.configService.get('AUTH_DOMAIN'),
-    };
-    this.app = initializeApp(this.firebaseConfig);
-    this.auth = getAuth(this.app);
-  }
+  ) {}
 
   async signInGIP(email: string, password: string): Promise<AuthentificationUserOutputDto> {
killedBy: GipService signinGIP should initialize Firebase configuration correctly
statusReason: Error: expect(received).toHaveProperty(path, value)

Matcher error: received value must not be null nor undefined

Received has value: undefined

[Killed] BlockStatement
src/services/gip/gip.service.ts:42:34
       const results = await Promise.allSettled(promises);
       let gipUser: GipUser;
       let welcomeUser: WelcomeUserDto;
-      for (const res of results) {
-        if (res.status === 'rejected') {
-          throw res.reason;
-        } else {
-          if ('user' in res.value) {
-            gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
-          } else {
-            welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {
-              excludeExtraneousValues: true,
-            });
-          }
-        }
-      }
+      for (const res of results) {}
       return { gipUser, welcomeUser };
     } catch (error) {
killedBy: GipService signinGIP should return user authentication information
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"accessToken": "test-token", "email": "test@test.fr", "refreshToken": "test-refresh-token", "uid": "test-uid"}
Received: undefined

[Killed] BlockStatement
src/services/gip/gip.service.ts:43:40
       let gipUser: GipUser;
       let welcomeUser: WelcomeUserDto;
       for (const res of results) {
-        if (res.status === 'rejected') {
-          throw res.reason;
-        } else {
+        if (res.status === 'rejected') {} else {
           if ('user' in res.value) {
             gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
killedBy: GipService signinGIP should throw BadRequestException if user is not found
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: BadRequestException
Received constructor: JestAssertionError

[Killed] BlockStatement
src/services/gip/gip.service.ts:45:16
       for (const res of results) {
         if (res.status === 'rejected') {
           throw res.reason;
-        } else {
-          if ('user' in res.value) {
-            gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
-          } else {
-            welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {
-              excludeExtraneousValues: true,
-            });
-          }
-        }
+        } else {}
       }
       return { gipUser, welcomeUser };
killedBy: GipService signinGIP should return user authentication information
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"accessToken": "test-token", "email": "test@test.fr", "refreshToken": "test-refresh-token", "uid": "test-uid"}
Received: undefined

[Killed] BlockStatement
src/services/gip/gip.service.ts:46:36
         if (res.status === 'rejected') {
           throw res.reason;
         } else {
-          if ('user' in res.value) {
-            gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
-          } else {
+          if ('user' in res.value) {} else {
             welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {
               excludeExtraneousValues: true,
killedBy: GipService signinGIP should return user authentication information
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"accessToken": "test-token", "email": "test@test.fr", "refreshToken": "test-refresh-token", "uid": "test-uid"}
Received: undefined

[Survived] BooleanLiteral
src/services/gip/gip.service.ts:47:91
           throw res.reason;
         } else {
           if ('user' in res.value) {
-            gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
+            gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: false });
           } else {
             welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {

[Survived] ObjectLiteral
src/services/gip/gip.service.ts:47:64
           throw res.reason;
         } else {
           if ('user' in res.value) {
-            gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
+            gipUser = plainToInstance(GipUser, res.value.user, {});
           } else {
             welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {

[Survived] BlockStatement
src/services/gip/gip.service.ts:48:18
         } else {
           if ('user' in res.value) {
             gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
-          } else {
-            welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {
-              excludeExtraneousValues: true,
-            });
-          }
+          } else {}
         }
       }

[Survived] ObjectLiteral
src/services/gip/gip.service.ts:49:87
           if ('user' in res.value) {
             gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
           } else {
-            welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {
-              excludeExtraneousValues: true,
-            });
+            welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {});
           }
         }

[Survived] BooleanLiteral
src/services/gip/gip.service.ts:50:40
             gipUser = plainToInstance(GipUser, res.value.user, { excludeExtraneousValues: true });
           } else {
             welcomeUser = plainToInstance(WelcomeUserDto, instanceToPlain(res.value), {
-              excludeExtraneousValues: true,
+              excludeExtraneousValues: false,
             });
           }

[Killed] BlockStatement
src/services/gip/gip.service.ts:56:21
         }
       }
       return { gipUser, welcomeUser };
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: GipService signinGIP should throw BadRequestException if user is not found
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: BadRequestException
Received constructor: JestAssertionError

[Killed] BlockStatement
src/services/gip/gip.service.ts:62:67
     }
   }
 
-  async signUpGIP(email: string, password: string): Promise<void> {
-    try {
-      await this.auth.authStateReady();
-      await this.firestoreService.getByEmail(FIRESTORE_COLLECTIONS.WELCOME_USERS, email);
-      await createUserWithEmailAndPassword(this.auth, email, password);
-    } catch (error) {
-      this.logger.error(error.message);
-      throw error;
-    }
-  }
+  async signUpGIP(email: string, password: string): Promise<void> {}
 }
 
killedBy: GipService signupGIP should throw BadRequestException if user creation fails
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: BadRequestException
Received constructor: JestAssertionError

[Killed] BlockStatement
src/services/gip/gip.service.ts:63:9
   }
 
   async signUpGIP(email: string, password: string): Promise<void> {
-    try {
-      await this.auth.authStateReady();
-      await this.firestoreService.getByEmail(FIRESTORE_COLLECTIONS.WELCOME_USERS, email);
-      await createUserWithEmailAndPassword(this.auth, email, password);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error.message);
       throw error;
killedBy: GipService signupGIP should throw BadRequestException if user creation fails
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: BadRequestException
Received constructor: JestAssertionError

[Killed] BlockStatement
src/services/gip/gip.service.ts:67:21
       await this.auth.authStateReady();
       await this.firestoreService.getByEmail(FIRESTORE_COLLECTIONS.WELCOME_USERS, email);
       await createUserWithEmailAndPassword(this.auth, email, password);
-    } catch (error) {
-      this.logger.error(error.message);
-      throw error;
-    }
+    } catch (error) {}
   }
 }
killedBy: GipService signupGIP should throw BadRequestException if user creation fails
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: BadRequestException
Received constructor: JestAssertionError
