[Killed] BlockStatement
src/modules/cognito/jwtCognito.service.ts:16:48
   }>;
   constructor(private readonly configService: ConfigService) {}
 
-  async verifyJwt(token: string): Promise<any> {
-    this.initCognitoJwt();
-    try {
-      return await this.verifier.verify(token);
-    } catch (error) {
-      throw new UnauthorizedException(error);
-    }
-  }
+  async verifyJwt(token: string): Promise<any> {}
 
   private initCognitoJwt() {
killedBy: jwtCognitoService should verify a correct jwt token
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/modules/cognito/jwtCognito.service.ts:18:9
 
   async verifyJwt(token: string): Promise<any> {
     this.initCognitoJwt();
-    try {
-      return await this.verifier.verify(token);
-    } catch (error) {
+    try {} catch (error) {
       throw new UnauthorizedException(error);
     }
killedBy: jwtCognitoService should verify a correct jwt token
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] BlockStatement
src/modules/cognito/jwtCognito.service.ts:25:28
     }
   }
 
-  private initCognitoJwt() {
-    try {
-      this.verifier = CognitoJwtVerifier.create({
-        userPoolId: this.configService.get('USER_POOL_ID'),
-        tokenUse: 'access',
-        clientId: this.configService.get('CLIENT_ID'),
-      });
-    } catch (error) {
-      throw new UnauthorizedException(error);
-    }
-  }
+  private initCognitoJwt() {}
 }
 
killedBy: jwtCognitoService should verify a correct jwt token
statusReason: UnauthorizedException: Cannot read properties of undefined (reading 'verify')

[Killed] BlockStatement
src/modules/cognito/jwtCognito.service.ts:26:9
   }
 
   private initCognitoJwt() {
-    try {
-      this.verifier = CognitoJwtVerifier.create({
-        userPoolId: this.configService.get('USER_POOL_ID'),
-        tokenUse: 'access',
-        clientId: this.configService.get('CLIENT_ID'),
-      });
-    } catch (error) {
+    try {} catch (error) {
       throw new UnauthorizedException(error);
     }
killedBy: jwtCognitoService should verify a correct jwt token
statusReason: UnauthorizedException: Cannot read properties of undefined (reading 'verify')

[Survived] StringLiteral
src/modules/cognito/jwtCognito.service.ts:28:44
   private initCognitoJwt() {
     try {
       this.verifier = CognitoJwtVerifier.create({
-        userPoolId: this.configService.get('USER_POOL_ID'),
+        userPoolId: this.configService.get(""),
         tokenUse: 'access',
         clientId: this.configService.get('CLIENT_ID'),

[NoCoverage] BlockStatement
src/modules/cognito/jwtCognito.service.ts:32:21
         tokenUse: 'access',
         clientId: this.configService.get('CLIENT_ID'),
       });
-    } catch (error) {
-      throw new UnauthorizedException(error);
-    }
+    } catch (error) {}
   }
 }
