[Survived] BlockStatement
src/services/firestore/firestore.service.ts:22:56
 
   private applyFilters(query: FirebaseFirestore.Query, filter: Filter): FirebaseFirestore.Query {
     let filteredQuery = query;
-    Object.entries(filter).forEach(([field, value]) => {
-      if (field === 'arrivalDate') {
-        Object.entries(value).forEach(([index, val]) => {
-          if (index === '$gte') {
-            filteredQuery = filteredQuery.where(field, '>=', val);
-          } else if (index === '$lte') {
-            filteredQuery = filteredQuery.where(field, '<=', val);
-          }
-        });
-      } else {
-        filteredQuery = filteredQuery.where(field, '==', value);
-      }
-    });
+    Object.entries(filter).forEach(([field, value]) => {});
 
     return filteredQuery;

[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:23:11
   private applyFilters(query: FirebaseFirestore.Query, filter: Filter): FirebaseFirestore.Query {
     let filteredQuery = query;
     Object.entries(filter).forEach(([field, value]) => {
-      if (field === 'arrivalDate') {
+      if (false) {
         Object.entries(value).forEach(([index, val]) => {
           if (index === '$gte') {

[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:23:11
   private applyFilters(query: FirebaseFirestore.Query, filter: Filter): FirebaseFirestore.Query {
     let filteredQuery = query;
     Object.entries(filter).forEach(([field, value]) => {
-      if (field === 'arrivalDate') {
+      if (true) {
         Object.entries(value).forEach(([index, val]) => {
           if (index === '$gte') {

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:24:57
     let filteredQuery = query;
     Object.entries(filter).forEach(([field, value]) => {
       if (field === 'arrivalDate') {
-        Object.entries(value).forEach(([index, val]) => {
-          if (index === '$gte') {
-            filteredQuery = filteredQuery.where(field, '>=', val);
-          } else if (index === '$lte') {
-            filteredQuery = filteredQuery.where(field, '<=', val);
-          }
-        });
+        Object.entries(value).forEach(([index, val]) => {});
       } else {
         filteredQuery = filteredQuery.where(field, '==', value);

[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:25:15
     Object.entries(filter).forEach(([field, value]) => {
       if (field === 'arrivalDate') {
         Object.entries(value).forEach(([index, val]) => {
-          if (index === '$gte') {
+          if (false) {
             filteredQuery = filteredQuery.where(field, '>=', val);
           } else if (index === '$lte') {

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:25:33
     Object.entries(filter).forEach(([field, value]) => {
       if (field === 'arrivalDate') {
         Object.entries(value).forEach(([index, val]) => {
-          if (index === '$gte') {
-            filteredQuery = filteredQuery.where(field, '>=', val);
-          } else if (index === '$lte') {
+          if (index === '$gte') {} else if (index === '$lte') {
             filteredQuery = filteredQuery.where(field, '<=', val);
           }

[Survived] EqualityOperator
src/services/firestore/firestore.service.ts:27:22
         Object.entries(value).forEach(([index, val]) => {
           if (index === '$gte') {
             filteredQuery = filteredQuery.where(field, '>=', val);
-          } else if (index === '$lte') {
+          } else if (index !== '$lte') {
             filteredQuery = filteredQuery.where(field, '<=', val);
           }

[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:27:22
         Object.entries(value).forEach(([index, val]) => {
           if (index === '$gte') {
             filteredQuery = filteredQuery.where(field, '>=', val);
-          } else if (index === '$lte') {
+          } else if (true) {
             filteredQuery = filteredQuery.where(field, '<=', val);
           }

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:31:14
             filteredQuery = filteredQuery.where(field, '<=', val);
           }
         });
-      } else {
-        filteredQuery = filteredQuery.where(field, '==', value);
-      }
+      } else {}
     });
 

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:49:38
       const filteredQuery = filter ? this.applyFilters(query, filter) : query;
       const querySnapshot = await filteredQuery.get();
 
-      querySnapshot.forEach((doc) => {
-        documents.push({
-          ...(doc.data() as T),
-        });
-      });
+      querySnapshot.forEach((doc) => {});
 
       return documents;
killedBy: firestoreService getAllDocuments the firestoreDb should return an Array user, with no filters
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 2
Received length: 0
Received array:  []

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:56:21
       });
 
       return documents;
-    } catch (error) {
-      throw new InternalServerErrorException(error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:69:9
       FirebaseFirestore.DocumentData,
       FirebaseFirestore.DocumentData
     >;
-    try {
-      documentSnapshot = await this.firestore.collection(collection).doc(documentId).get();
-    } catch (error) {
+    try {} catch (error) {
       throw new InternalServerErrorException(error);
     }
killedBy: firestoreService getDocument the firestoreDB should return an user Object
statusReason: TypeError: Cannot read properties of undefined (reading 'exists')

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:71:21
     >;
     try {
       documentSnapshot = await this.firestore.collection(collection).doc(documentId).get();
-    } catch (error) {
-      throw new InternalServerErrorException(error);
-    }
+    } catch (error) {}
 
     if (!documentSnapshot.exists) {

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:75:9
       throw new InternalServerErrorException(error);
     }
 
-    if (!documentSnapshot.exists) {
+    if (false) {
       throw new NotFoundException('Document not found in DB');
     }
killedBy: firestoreService getDocument the firestoreDB should return an empty object
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HttpException
Received constructor: TypeError

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:75:9
       throw new InternalServerErrorException(error);
     }
 
-    if (!documentSnapshot.exists) {
+    if (true) {
       throw new NotFoundException('Document not found in DB');
     }
killedBy: firestoreService getDocument the firestoreDB should return an user Object
statusReason: NotFoundException: Document not found in DB

[Killed] EqualityOperator
src/services/firestore/firestore.service.ts:85:9
   async getByEmail<T extends FirestoreDocumentType>(collection: FIRESTORE_COLLECTIONS, email: string): Promise<T> {
     let document: T;
     const documentsSnapshot = await this.firestore.collection(collection).where('email', '==', email).get();
-    if (documentsSnapshot.size > 1) {
+    if (documentsSnapshot.size >= 1) {
       throw new HttpException('Multiple users found', 400);
     } else if (documentsSnapshot.size === 1) {
killedBy: firestoreService getByEmail firestoreDb should return an WelcomeUser object
statusReason: HttpException: Multiple users found

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:85:9
   async getByEmail<T extends FirestoreDocumentType>(collection: FIRESTORE_COLLECTIONS, email: string): Promise<T> {
     let document: T;
     const documentsSnapshot = await this.firestore.collection(collection).where('email', '==', email).get();
-    if (documentsSnapshot.size > 1) {
+    if (true) {
       throw new HttpException('Multiple users found', 400);
     } else if (documentsSnapshot.size === 1) {
killedBy: firestoreService getByEmail firestoreDb should return an WelcomeUser object
statusReason: HttpException: Multiple users found

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:87:46
     const documentsSnapshot = await this.firestore.collection(collection).where('email', '==', email).get();
     if (documentsSnapshot.size > 1) {
       throw new HttpException('Multiple users found', 400);
-    } else if (documentsSnapshot.size === 1) {
-      documentsSnapshot.forEach((doc) => {
-        document = doc.data() as T;
-      });
-    } else {
+    } else if (documentsSnapshot.size === 1) {} else {
       throw new NotFoundException('User not found in DB');
     }
killedBy: firestoreService getByEmail firestoreDb should return an WelcomeUser object
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:87:16
     const documentsSnapshot = await this.firestore.collection(collection).where('email', '==', email).get();
     if (documentsSnapshot.size > 1) {
       throw new HttpException('Multiple users found', 400);
-    } else if (documentsSnapshot.size === 1) {
+    } else if (false) {
       documentsSnapshot.forEach((doc) => {
         document = doc.data() as T;
killedBy: firestoreService getByEmail firestoreDb should return an WelcomeUser object
statusReason: NotFoundException: User not found in DB

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:88:42
     if (documentsSnapshot.size > 1) {
       throw new HttpException('Multiple users found', 400);
     } else if (documentsSnapshot.size === 1) {
-      documentsSnapshot.forEach((doc) => {
-        document = doc.data() as T;
-      });
+      documentsSnapshot.forEach((doc) => {});
     } else {
       throw new NotFoundException('User not found in DB');
killedBy: firestoreService getByEmail firestoreDb should return an WelcomeUser object
statusReason: Error: expect(received).toBeDefined()

Received: undefined

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:91:12
       documentsSnapshot.forEach((doc) => {
         document = doc.data() as T;
       });
-    } else {
-      throw new NotFoundException('User not found in DB');
-    }
+    } else {}
 
     return document;

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:112:21
       this.logger.log(`[saveDocument] - data saved to database, id:${id}`);
 
       return await this.getDocument(collection, id);
-    } catch (error) {
-      if (error.code === FirestoreErrorCode.ALREADY_EXISTS) {
-        throw new HttpException('Document already exists.', HttpStatus.CONFLICT);
-      }
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[Killed] EqualityOperator
src/services/firestore/firestore.service.ts:113:11
 
       return await this.getDocument(collection, id);
     } catch (error) {
-      if (error.code === FirestoreErrorCode.ALREADY_EXISTS) {
+      if (error.code !== FirestoreErrorCode.ALREADY_EXISTS) {
         throw new HttpException('Document already exists.', HttpStatus.CONFLICT);
       }
killedBy: firestoreService saveDocument firestoreDb should throw an FirestoreError already exists
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HttpException
Received constructor: Error

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:113:61
 
       return await this.getDocument(collection, id);
     } catch (error) {
-      if (error.code === FirestoreErrorCode.ALREADY_EXISTS) {
-        throw new HttpException('Document already exists.', HttpStatus.CONFLICT);
-      }
+      if (error.code === FirestoreErrorCode.ALREADY_EXISTS) {}
       this.logger.error(error);
       throw error;
killedBy: firestoreService saveDocument firestoreDb should throw an FirestoreError already exists
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: HttpException
Received constructor: Error

[Killed] StringLiteral
src/services/firestore/firestore.service.ts:114:33
       return await this.getDocument(collection, id);
     } catch (error) {
       if (error.code === FirestoreErrorCode.ALREADY_EXISTS) {
-        throw new HttpException('Document already exists.', HttpStatus.CONFLICT);
+        throw new HttpException("", HttpStatus.CONFLICT);
       }
       this.logger.error(error);
killedBy: firestoreService saveDocument firestoreDb should throw an FirestoreError already exists
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: "Document already exists."
Received: ""

[NoCoverage] BooleanLiteral
src/services/firestore/firestore.service.ts:130:36
       await this.firestore
         .collection(collection)
         .doc(documentId)
-        .set({ ...data }, { merge: true });
+        .set({ ...data }, { merge: false });
       return await this.getDocument(collection, documentId);
     } catch (error) {

[NoCoverage] ObjectLiteral
src/services/firestore/firestore.service.ts:130:14
       await this.firestore
         .collection(collection)
         .doc(documentId)
-        .set({ ...data }, { merge: true });
+        .set({}, { merge: true });
       return await this.getDocument(collection, documentId);
     } catch (error) {

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:132:21
         .doc(documentId)
         .set({ ...data }, { merge: true });
       return await this.getDocument(collection, documentId);
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException(error);
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:138:94
     }
   }
 
-  async deleteDocument(collection: FIRESTORE_COLLECTIONS, documentId: string): Promise<void> {
-    await this.firestore.collection(collection).doc(documentId).delete();
-  }
+  async deleteDocument(collection: FIRESTORE_COLLECTIONS, documentId: string): Promise<void> {}
 
   async updateManyDocuments(

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:146:20
     collection: FIRESTORE_COLLECTIONS,
     filter: Filter,
     data: Record<string, unknown>,
-  ): Promise<void> {
-    try {
-      const collectionRef = this.firestore.collection(collection);
-
-      let query = collectionRef as Query;
-      Object.keys(filter).forEach((key) => {
-        query = query.where(key, '==', filter[key]);
-      });
-
-      const snapshot = await query.get();
-      const batch = this.firestore.batch();
-      snapshot.forEach((doc) => {
-        const docRef = collectionRef.doc(doc.id);
-        batch.update(docRef, data);
-      });
-
-      await batch.commit();
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
-  }
+  ): Promise<void> {}
 
   /**

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:147:9
     filter: Filter,
     data: Record<string, unknown>,
   ): Promise<void> {
-    try {
-      const collectionRef = this.firestore.collection(collection);
-
-      let query = collectionRef as Query;
-      Object.keys(filter).forEach((key) => {
-        query = query.where(key, '==', filter[key]);
-      });
-
-      const snapshot = await query.get();
-      const batch = this.firestore.batch();
-      snapshot.forEach((doc) => {
-        const docRef = collectionRef.doc(doc.id);
-        batch.update(docRef, data);
-      });
-
-      await batch.commit();
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw error;

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:151:44
       const collectionRef = this.firestore.collection(collection);
 
       let query = collectionRef as Query;
-      Object.keys(filter).forEach((key) => {
-        query = query.where(key, '==', filter[key]);
-      });
+      Object.keys(filter).forEach((key) => {});
 
       const snapshot = await query.get();

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:157:33
 
       const snapshot = await query.get();
       const batch = this.firestore.batch();
-      snapshot.forEach((doc) => {
-        const docRef = collectionRef.doc(doc.id);
-        batch.update(docRef, data);
-      });
+      snapshot.forEach((doc) => {});
 
       await batch.commit();

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:163:21
       });
 
       await batch.commit();
-    } catch (error) {
-      this.logger.error(error);
-      throw error;
-    }
+    } catch (error) {}
   }
 

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:180:9
    * @param  {string} property the property that needs to be transformed to an object
    */
   async transformToObjectAndSaveProperty(collection: FIRESTORE_COLLECTIONS, property: string): Promise<void> {
-    try {
-      const documents = (await this.getAllDocuments(collection)) as WelcomeUser[];
-
-      for (const doc of documents) {
-        let value = doc[property];
-        if (value === undefined || value === null) {
-          continue;
-        }
-
-        if (value === '') {
-          value = {};
-        } else if (value && typeof value === 'string') {
-          try {
-            const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));
-            value = propertyToObject;
-            await this.updateDocument(collection, doc._id, { [property]: value });
-          } catch (error) {
-            this.logger.error(`Error parsing property for document ${doc._id}:`, error);
-          }
-        }
-      }
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error('Error transforming and saving appGames:', error);
       throw error;

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:183:36
     try {
       const documents = (await this.getAllDocuments(collection)) as WelcomeUser[];
 
-      for (const doc of documents) {
-        let value = doc[property];
-        if (value === undefined || value === null) {
-          continue;
-        }
-
-        if (value === '') {
-          value = {};
-        } else if (value && typeof value === 'string') {
-          try {
-            const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));
-            value = propertyToObject;
-            await this.updateDocument(collection, doc._id, { [property]: value });
-          } catch (error) {
-            this.logger.error(`Error parsing property for document ${doc._id}:`, error);
-          }
-        }
-      }
+      for (const doc of documents) {}
     } catch (error) {
       this.logger.error('Error transforming and saving appGames:', error);

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:185:52
 
       for (const doc of documents) {
         let value = doc[property];
-        if (value === undefined || value === null) {
-          continue;
-        }
+        if (value === undefined || value === null) {}
 
         if (value === '') {

[NoCoverage] EqualityOperator
src/services/firestore/firestore.service.ts:185:36
 
       for (const doc of documents) {
         let value = doc[property];
-        if (value === undefined || value === null) {
+        if (value === undefined || value !== null) {
           continue;
         }

[NoCoverage] ConditionalExpression
src/services/firestore/firestore.service.ts:189:13
           continue;
         }
 
-        if (value === '') {
+        if (true) {
           value = {};
         } else if (value && typeof value === 'string') {

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:189:27
           continue;
         }
 
-        if (value === '') {
-          value = {};
-        } else if (value && typeof value === 'string') {
+        if (value === '') {} else if (value && typeof value === 'string') {
           try {
             const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));

[NoCoverage] LogicalOperator
src/services/firestore/firestore.service.ts:191:20
 
         if (value === '') {
           value = {};
-        } else if (value && typeof value === 'string') {
+        } else if (value || typeof value === 'string') {
           try {
             const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));

[NoCoverage] ConditionalExpression
src/services/firestore/firestore.service.ts:191:20
 
         if (value === '') {
           value = {};
-        } else if (value && typeof value === 'string') {
+        } else if (true) {
           try {
             const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:192:15
         if (value === '') {
           value = {};
         } else if (value && typeof value === 'string') {
-          try {
-            const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));
-            value = propertyToObject;
-            await this.updateDocument(collection, doc._id, { [property]: value });
-          } catch (error) {
+          try {} catch (error) {
             this.logger.error(`Error parsing property for document ${doc._id}:`, error);
           }

[NoCoverage] ObjectLiteral
src/services/firestore/firestore.service.ts:195:60
           try {
             const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));
             value = propertyToObject;
-            await this.updateDocument(collection, doc._id, { [property]: value });
+            await this.updateDocument(collection, doc._id, {});
           } catch (error) {
             this.logger.error(`Error parsing property for document ${doc._id}:`, error);

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:196:27
             const propertyToObject: object = JSON.parse(value.replace(/'/g, '"'));
             value = propertyToObject;
             await this.updateDocument(collection, doc._id, { [property]: value });
-          } catch (error) {
-            this.logger.error(`Error parsing property for document ${doc._id}:`, error);
-          }
+          } catch (error) {}
         }
       }

[NoCoverage] BlockStatement
src/services/firestore/firestore.service.ts:201:21
           }
         }
       }
-    } catch (error) {
-      this.logger.error('Error transforming and saving appGames:', error);
-      throw error;
-    }
+    } catch (error) {}
   }
 }
