[Killed] BlockStatement
modules/welcome/entities/user.entity.ts:24:46
 }
 
 export class WelcomeUser {
-  constructor(partial: Partial<WelcomeUser>) {
-    Object.assign(this, partial);
-  }
+  constructor(partial: Partial<WelcomeUser>) {}
   _id: string;
   email: string;
killedBy: StepService generateSteps should generate steps
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Object {
