[Killed] BlockStatement
src/modules/client/client.service.ts:31:50
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.CLIENTS, id, instanceToPlain(updateClientDto));
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.CLIENTS, id);
-  }
+  public async remove(id: string): Promise<void> {}
 }
killedBy: ClientService remove should delete a client when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
