[Killed] BlockStatement
src/modules/practice/practice.service.ts:31:50
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.PRACTICES, id, instanceToPlain(updatePracticeDto));
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.PRACTICES, id);
-  }
+  public async remove(id: string): Promise<void> {}
 }
killedBy: PracticeService remove should delete a practice when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
