[Survived] StringLiteral
src/guards/api-key.guard.ts:18:61
   }
 
   private isApiKeyValid(apiKey: string): boolean {
-    const apiKeyFromConfig = this.configService.get<string>("API_KEY");
+    const apiKeyFromConfig = this.configService.get<string>("");
     const bufferedApiKey = Buffer.from(apiKey);
     const bufferedApiKeyFromConfig = Buffer.from(apiKeyFromConfig);

[Killed] ConditionalExpression
src/guards/api-key.guard.ts:21:32
     const apiKeyFromConfig = this.configService.get<string>("API_KEY");
     const bufferedApiKey = Buffer.from(apiKey);
     const bufferedApiKeyFromConfig = Buffer.from(apiKeyFromConfig);
-    const areBuffersSameSize = bufferedApiKey.length === bufferedApiKeyFromConfig.length;
+    const areBuffersSameSize = true;
 
     return areBuffersSameSize && timingSafeEqual(bufferedApiKey, bufferedApiKeyFromConfig);
killedBy: Api Key Guard isApiKeyValid should return false when api key is invalid.
statusReason: RangeError: Input buffers must have the same byte length

[Killed] EqualityOperator
src/guards/api-key.guard.ts:21:32
     const apiKeyFromConfig = this.configService.get<string>("API_KEY");
     const bufferedApiKey = Buffer.from(apiKey);
     const bufferedApiKeyFromConfig = Buffer.from(apiKeyFromConfig);
-    const areBuffersSameSize = bufferedApiKey.length === bufferedApiKeyFromConfig.length;
+    const areBuffersSameSize = bufferedApiKey.length !== bufferedApiKeyFromConfig.length;
 
     return areBuffersSameSize && timingSafeEqual(bufferedApiKey, bufferedApiKeyFromConfig);
killedBy: Api Key Guard isApiKeyValid should return false when api key is invalid.
statusReason: RangeError: Input buffers must have the same byte length

[Killed] LogicalOperator
src/guards/api-key.guard.ts:23:12
     const bufferedApiKeyFromConfig = Buffer.from(apiKeyFromConfig);
     const areBuffersSameSize = bufferedApiKey.length === bufferedApiKeyFromConfig.length;
 
-    return areBuffersSameSize && timingSafeEqual(bufferedApiKey, bufferedApiKeyFromConfig);
+    return areBuffersSameSize || timingSafeEqual(bufferedApiKey, bufferedApiKeyFromConfig);
   }
 }
killedBy: Api Key Guard isApiKeyValid should return false when api key is invalid.
statusReason: RangeError: Input buffers must have the same byte length

[Killed] ConditionalExpression
src/guards/api-key.guard.ts:23:12
     const bufferedApiKeyFromConfig = Buffer.from(apiKeyFromConfig);
     const areBuffersSameSize = bufferedApiKey.length === bufferedApiKeyFromConfig.length;
 
-    return areBuffersSameSize && timingSafeEqual(bufferedApiKey, bufferedApiKeyFromConfig);
+    return true;
   }
 }
killedBy: Api Key Guard isApiKeyValid should return false when api key is invalid.
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
