[Survived] BlockStatement
src/modules/agencies/agencies.service.ts:17:80
     return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, instanceToPlain(createAgencyDto));
   }
 
-  public async createMany(createAgenciesDto: CreateAgencyDto[]): Promise<void> {
-    await Promise.all(createAgenciesDto.map(async agency => {
-      const newAgency = instanceToPlain(agency);
-
-      return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, newAgency);
-    }));
-  }
+  public async createMany(createAgenciesDto: CreateAgencyDto[]): Promise<void> {}
 
   public async findAll(): Promise<Agency[]> {

[Survived] BlockStatement
src/modules/agencies/agencies.service.ts:18:61
   }
 
   public async createMany(createAgenciesDto: CreateAgencyDto[]): Promise<void> {
-    await Promise.all(createAgenciesDto.map(async agency => {
-      const newAgency = instanceToPlain(agency);
-
-      return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, newAgency);
-    }));
+    await Promise.all(createAgenciesDto.map(async agency => {}));
   }
 

[Survived] BlockStatement
src/modules/agencies/agencies.service.ts:33:50
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, id, instanceToPlain(updateAgencyDto));
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_AGENCIES, id);
-  }
+  public async remove(id: string): Promise<void> {}
 }
