[Killed] BlockStatement
src/modules/cloud-storage/cloud-storage.service.ts:11:69
 
   private readonly bucket: string;
 
-  public constructor(private readonly configService: ConfigService) {
-    this.storage = new Storage();
-    this.bucket = this.configService.get("NAME_BUCKET_STATIC_CONTENT");
-  }
+  public constructor(private readonly configService: ConfigService) {}
 
   public async getContent(filename: string): Promise<Buffer> {
killedBy: CloudStorageService getContent should return file content
statusReason: TypeError: Cannot read properties of undefined (reading 'bucket')

[Survived] BlockStatement
src/modules/cloud-storage/cloud-storage.service.ts:22:21
       const [fileContent] = await file.download();
 
       return fileContent;
-    } catch (error) {
-      if (error instanceof Error) {
-        throw new BadRequestException(error.message);
-      }
-    }
+    } catch (error) {}
   }
 

[Survived] ConditionalExpression
src/modules/cloud-storage/cloud-storage.service.ts:23:11
 
       return fileContent;
     } catch (error) {
-      if (error instanceof Error) {
+      if (false) {
         throw new BadRequestException(error.message);
       }

[Survived] ConditionalExpression
src/modules/cloud-storage/cloud-storage.service.ts:23:11
 
       return fileContent;
     } catch (error) {
-      if (error instanceof Error) {
+      if (true) {
         throw new BadRequestException(error.message);
       }

[Killed] StringLiteral
src/modules/cloud-storage/cloud-storage.service.ts:30:52
   }
 
   public getExtension(filename: string): string {
-    const filenameSplit: string[] = filename.split(".");
+    const filenameSplit: string[] = filename.split("");
     const extension = filenameSplit[1];
 
killedBy: CloudStorageService getExtension should return correct content type for jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/jpg"
Received: "image/e"

[Killed] ConditionalExpression
src/modules/cloud-storage/cloud-storage.service.ts:33:12
     const filenameSplit: string[] = filename.split(".");
     const extension = filenameSplit[1];
 
-    return extension === "svg" ? `image/${extension}+xml` : `image/${extension}`;
+    return false ? `image/${extension}+xml` : `image/${extension}`;
   }
 }
killedBy: CloudStorageService getExtension should return correct content type for svg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/svg+xml"
Received: "image/svg"

[Killed] ConditionalExpression
src/modules/cloud-storage/cloud-storage.service.ts:33:12
     const filenameSplit: string[] = filename.split(".");
     const extension = filenameSplit[1];
 
-    return extension === "svg" ? `image/${extension}+xml` : `image/${extension}`;
+    return true ? `image/${extension}+xml` : `image/${extension}`;
   }
 }
killedBy: CloudStorageService getExtension should return correct content type for jpg
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "image/jpg"
Received: "image/jpg+xml"
