[Killed] BlockStatement
src/modules/feedback/feedback.service.ts:31:50
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.FEEDBACKS, id, instanceToPlain(updateFeedbackDto));
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    const doc = this.firestoreService.getDoc(FIRESTORE_COLLECTIONS.FEEDBACKS, id);
-    await this.firestoreService.deleteRecursive(doc);
-  }
+  public async remove(id: string): Promise<void> {}
 }
killedBy: FeedbackService remove should delete a feedback when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
