[Survived] ObjectLiteral
src/modules/feedback-answer/feedback-answer.service.ts:21:7
 
     return this.firestoreService.saveDocument(
       FIRESTORE_COLLECTIONS.FEEDBACKS_ANSWERS,
-      { _id: userId, answers },
+      {},
       parentDoc,
     );

[Killed] BlockStatement
src/modules/feedback-answer/feedback-answer.service.ts:48:86
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.FEEDBACKS_ANSWERS, userId, { answers }, parentDoc);
   }
 
-  public async remove(id: string, questionId: string, userId: string): Promise<void> {
-    await this.findOne(id, questionId, userId);
-    const feedbackDoc = this.firestoreService.getDoc(FIRESTORE_COLLECTIONS.FEEDBACKS, id);
-    const parentDoc = this.firestoreService.getDoc(FIRESTORE_COLLECTIONS.FEEDBACKS_QUESTIONS, questionId, feedbackDoc);
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.FEEDBACKS_ANSWERS, userId, parentDoc);
-  }
+  public async remove(id: string, questionId: string, userId: string): Promise<void> {}
 }
killedBy: FeedbackAnswerService remove should delete a feedback answer when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
