[Killed] BlockStatement
src/modules/feedback-question/feedback-question.service.ts:38:70
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.FEEDBACKS_QUESTIONS, questionId, instanceToPlain(updateFeedbackDto), parentDoc);
   }
 
-  public async remove(id: string, questionId: string): Promise<void> {
-    await this.findOne(id, questionId);
-    const parentDoc = this.firestoreService.getDoc(FIRESTORE_COLLECTIONS.FEEDBACKS, id);
-    const doc = this.firestoreService.getDoc(FIRESTORE_COLLECTIONS.FEEDBACKS_QUESTIONS, questionId, parentDoc);
-    await this.firestoreService.deleteRecursive(doc);
-  }
+  public async remove(id: string, questionId: string): Promise<void> {}
 }
killedBy: FeedbackQuestionService remove should delete a feedback question when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
