[Survived] BlockStatement
src/modules/members/members.service.ts:19:78
     return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, member);
   }
 
-  public async createMany(createMemberDto: CreateMemberDto[]): Promise<void> {
-    await Promise.all(createMemberDto.map(async member => {
-      const newMember = instanceToPlain(member);
-
-      return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, newMember);
-    }));
-  }
+  public async createMany(createMemberDto: CreateMemberDto[]): Promise<void> {}
 
   public async findAll(): Promise<Member[]> {

[Survived] BlockStatement
src/modules/members/members.service.ts:20:59
   }
 
   public async createMany(createMemberDto: CreateMemberDto[]): Promise<void> {
-    await Promise.all(createMemberDto.map(async member => {
-      const newMember = instanceToPlain(member);
-
-      return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, newMember);
-    }));
+    await Promise.all(createMemberDto.map(async member => {}));
   }
 

[Survived] BlockStatement
src/modules/members/members.service.ts:37:50
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, id, updatedMember);
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_MEMBERS, id);
-  }
+  public async remove(id: string): Promise<void> {}
 }
