[Killed] BlockStatement
src/modules/quiz/quiz.service.ts:31:50
     return this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.QUIZZES, id, instanceToPlain(updateQuizDto));
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.QUIZZES, id);
-  }
+  public async remove(id: string): Promise<void> {}
 
   /**
killedBy: QuizService remove should throw when database fails (500).
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] ConditionalExpression
src/modules/quiz/quiz.service.ts:47:11
     const quiz = await this.findOne(quizId);
 
     return quiz.questions[questionIndex].answers.flatMap((answer, i) => {
-      if (answer.isCorrect && answerIndexes.includes(i)) {
+      if (true) {
         return [i];
       }
killedBy: QuizService checkCorrectness should returns intersection of correct and given answers (all corrects).
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 0
+ Received  + 3

  Array [
+   0,
+   1,

[Killed] ConditionalExpression
src/modules/quiz/quiz.service.ts:47:11
     const quiz = await this.findOne(quizId);
 
     return quiz.questions[questionIndex].answers.flatMap((answer, i) => {
-      if (answer.isCorrect && answerIndexes.includes(i)) {
+      if (false) {
         return [i];
       }
killedBy: QuizService checkCorrectness should returns intersection of correct and given answers (all corrects).
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 1

- Array [
-   2,
-   4,
