[NoCoverage] BlockStatement
modules/shared/cache/cache.service.ts:8:17
 export class CacheService {
   private readonly cache: NodeCache;
 
-  constructor() {
-    this.cache = new NodeCache();
-  }
+  constructor() {}
 
   get(key: string): unknown {
