[Killed] BlockStatement
src/modules/step/step.service.ts:36:50
     return this.findOne(id);
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.STEPS, id);
-  }
+  public async remove(id: string): Promise<void> {}
 
   /**
killedBy: StepService delete should delete a step when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0
