[Killed] ArithmeticOperator
src/modules/step/step.utils.ts:14:10
  * @return date2 - The second date
  */
 function dayDiff(date1: Date, date2: Date) {
-  return (date1.getTime() - date2.getTime()) / DAY_IN_MS;
+  return (date1.getTime() - date2.getTime()) * DAY_IN_MS;
 }
 
killedBy: StepService generateSteps should generate steps when generateSteps is called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Object {

[Killed] ArithmeticOperator
src/modules/step/step.utils.ts:14:11
  * @return date2 - The second date
  */
 function dayDiff(date1: Date, date2: Date) {
-  return (date1.getTime() - date2.getTime()) / DAY_IN_MS;
+  return (date1.getTime() + date2.getTime()) / DAY_IN_MS;
 }
 
killedBy: calculateEmailDate should throw an error for start date > end date
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/modules/step/step.utils.ts:26:5
 function getFirstBusinessDayFrom(date: Date, holidays: Holidays) {
   const businessDay = new Date(date);
   while (
-    [0, 6].includes(businessDay.getDay()) || // week-end
-    holidays.isHoliday(businessDay) // holiday
+    false // holiday
   ) {
     businessDay.setUTCDate(businessDay.getUTCDate() + 1);
killedBy: calculateEmailDate should handle multiple consecutive holidays
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "dt": 2024-05-10T00:00:00.000Z,

[Killed] LogicalOperator
src/modules/step/step.utils.ts:26:5
 function getFirstBusinessDayFrom(date: Date, holidays: Holidays) {
   const businessDay = new Date(date);
   while (
-    [0, 6].includes(businessDay.getDay()) || // week-end
-    holidays.isHoliday(businessDay) // holiday
+    [0, 6].includes(businessDay.getDay()) &&
+// week-end
+holidays.isHoliday(businessDay) // holiday // holiday
   ) {
     businessDay.setUTCDate(businessDay.getUTCDate() + 1);
killedBy: calculateEmailDate should handle multiple consecutive holidays
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "dt": 2024-05-10T00:00:00.000Z,

[Timeout] BlockStatement
src/modules/step/step.utils.ts:28:5
   while (
     [0, 6].includes(businessDay.getDay()) || // week-end
     holidays.isHoliday(businessDay) // holiday
-  ) {
-    businessDay.setUTCDate(businessDay.getUTCDate() + 1);
-  }
+  ) {}
   return businessDay;
 }

[Killed] ArithmeticOperator
src/modules/step/step.utils.ts:29:28
     [0, 6].includes(businessDay.getDay()) || // week-end
     holidays.isHoliday(businessDay) // holiday
   ) {
-    businessDay.setUTCDate(businessDay.getUTCDate() + 1);
+    businessDay.setUTCDate(businessDay.getUTCDate() - 1);
   }
   return businessDay;
killedBy: calculateEmailDate should handle multiple consecutive holidays
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
    Object {
-     "dt": 2024-05-10T00:00:00.000Z,

[Killed] BlockStatement
src/modules/step/step.utils.ts:44:17
  */
 export function generateStepDates(startDate: Date, endDate: Date, steps: Step[], country: string) {
   const diff = dayDiff(endDate, startDate);
-  if (diff < 0) {
-    throw new HttpException("Invalid parameter: startDate > endDate", HttpStatus.BAD_REQUEST);
-  }
+  if (diff < 0) {}
   const holidays = new Holidays(country, { types: ["public"] });
 
killedBy: calculateEmailDate should throw an error for start date > end date
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Killed] ConditionalExpression
src/modules/step/step.utils.ts:44:7
  */
 export function generateStepDates(startDate: Date, endDate: Date, steps: Step[], country: string) {
   const diff = dayDiff(endDate, startDate);
-  if (diff < 0) {
+  if (false) {
     throw new HttpException("Invalid parameter: startDate > endDate", HttpStatus.BAD_REQUEST);
   }
killedBy: calculateEmailDate should throw an error for start date > end date
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Survived] StringLiteral
src/modules/step/step.utils.ts:45:29
 export function generateStepDates(startDate: Date, endDate: Date, steps: Step[], country: string) {
   const diff = dayDiff(endDate, startDate);
   if (diff < 0) {
-    throw new HttpException("Invalid parameter: startDate > endDate", HttpStatus.BAD_REQUEST);
+    throw new HttpException("", HttpStatus.BAD_REQUEST);
   }
   const holidays = new Holidays(country, { types: ["public"] });

[Killed] BlockStatement
src/modules/step/step.utils.ts:52:46
   return steps.map(step => {
     const stepStartDate = new Date(startDate);
     const stepEndDate = new Date(endDate);
-    if (step.minDays && diff < step.minDays) {
-      stepEndDate.setTime(startDate.getTime());
-    } else if (step.maxDays && diff > step.maxDays) {
+    if (step.minDays && diff < step.minDays) {} else if (step.maxDays && diff > step.maxDays) {
       stepStartDate.setTime(endDate.getTime());
       stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
killedBy: calculateEmailDate should handle minimal interval correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 518400000

[Killed] ConditionalExpression
src/modules/step/step.utils.ts:52:9
   return steps.map(step => {
     const stepStartDate = new Date(startDate);
     const stepEndDate = new Date(endDate);
-    if (step.minDays && diff < step.minDays) {
+    if (false) {
       stepEndDate.setTime(startDate.getTime());
     } else if (step.maxDays && diff > step.maxDays) {
killedBy: calculateEmailDate should handle minimal interval correctly
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 518400000

[Killed] ConditionalExpression
src/modules/step/step.utils.ts:54:32
     const stepEndDate = new Date(endDate);
     if (step.minDays && diff < step.minDays) {
       stepEndDate.setTime(startDate.getTime());
-    } else if (step.maxDays && diff > step.maxDays) {
+    } else if (step.maxDays && true) {
       stepStartDate.setTime(endDate.getTime());
       stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
killedBy: StepService generateSteps should generate steps when generateSteps is called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

@@ -1,8 +1,8 @@
  Array [
    Object {

[Killed] EqualityOperator
src/modules/step/step.utils.ts:54:32
     const stepEndDate = new Date(endDate);
     if (step.minDays && diff < step.minDays) {
       stepEndDate.setTime(startDate.getTime());
-    } else if (step.maxDays && diff > step.maxDays) {
+    } else if (step.maxDays && diff <= step.maxDays) {
       stepStartDate.setTime(endDate.getTime());
       stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
killedBy: calculateEmailDate should handle maximal interval correctly
statusReason: Error: expect(received).toBeLessThanOrEqual(expected)

Expected: <= 7776000000
Received:    15724800000

[Survived] ArithmeticOperator
src/modules/step/step.utils.ts:56:32
       stepEndDate.setTime(startDate.getTime());
     } else if (step.maxDays && diff > step.maxDays) {
       stepStartDate.setTime(endDate.getTime());
-      stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
+      stepStartDate.setUTCDate(stepStartDate.getUTCDate() + step.maxDays);
     }
 

[Killed] ArithmeticOperator
src/modules/step/step.utils.ts:59:70
       stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
     }
 
-    stepStartDate.setUTCDate(stepStartDate.getUTCDate() + Math.floor(dayDiff(stepEndDate, stepStartDate) * step.cutAt));
+    stepStartDate.setUTCDate(stepStartDate.getUTCDate() + Math.floor(dayDiff(stepEndDate, stepStartDate) / step.cutAt));
 
     return { step, dt: getFirstBusinessDayFrom(stepStartDate, holidays) };
killedBy: calculateEmailDate should handle cutAt correctly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -1,14 +1,14 @@
  Array [
    Object {

[Killed] ArithmeticOperator
src/modules/step/step.utils.ts:59:30
       stepStartDate.setUTCDate(stepStartDate.getUTCDate() - step.maxDays);
     }
 
-    stepStartDate.setUTCDate(stepStartDate.getUTCDate() + Math.floor(dayDiff(stepEndDate, stepStartDate) * step.cutAt));
+    stepStartDate.setUTCDate(stepStartDate.getUTCDate() - Math.floor(dayDiff(stepEndDate, stepStartDate) * step.cutAt));
 
     return { step, dt: getFirstBusinessDayFrom(stepStartDate, holidays) };
killedBy: calculateEmailDate should handle cutAt correctly
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

@@ -4,17 +4,17 @@
      "step": Step {
        "cutAt": 0,
