[NoCoverage] ArrowFunction
modules/step/templates/index.ts:5:22
 
 
-const stepTemplate = (user: WelcomeUser, unlockedSteps: number[]) => `<html lang="fr">
-  <head>
-    <meta http-equiv="Content-type" content="text/html; charset=utf-8">
-    <meta name="viewport" content="width=device-width, initial-scale=1.0">
-  </head>
-  <body>
-    <p>
-      Bonjour ${user.firstName},<br /><br />
-      ${stepUnlockedString(unlockedSteps)}<br /><br />
-      Cordialement.
-    </p>
-  </body>
-</html>`;
+const stepTemplate = () => undefined;
 
 const welcomeTemplate = (user: WelcomeUser, unlockedSteps: number[]) => `<html lang="fr">

[NoCoverage] StringLiteral
modules/step/templates/index.ts:5:70
 
 
-const stepTemplate = (user: WelcomeUser, unlockedSteps: number[]) => `<html lang="fr">
-  <head>
-    <meta http-equiv="Content-type" content="text/html; charset=utf-8">
-    <meta name="viewport" content="width=device-width, initial-scale=1.0">
-  </head>
-  <body>
-    <p>
-      Bonjour ${user.firstName},<br /><br />
-      ${stepUnlockedString(unlockedSteps)}<br /><br />
-      Cordialement.
-    </p>
-  </body>
-</html>`;
+const stepTemplate = (user: WelcomeUser, unlockedSteps: number[]) => ``;
 
 const welcomeTemplate = (user: WelcomeUser, unlockedSteps: number[]) => `<html lang="fr">

[NoCoverage] ArrowFunction
modules/step/templates/index.ts:19:25
   </body>
 </html>`;
 
-const welcomeTemplate = (user: WelcomeUser, unlockedSteps: number[]) => `<html lang="fr">
-  <head>
-    <meta http-equiv="Content-type" content="text/html; charset=utf-8">
-    <meta name="viewport" content="width=device-width, initial-scale=1.0">
-  </head>
-  <body>
-    <p>
-      Bonjour ${user.firstName},<br /><br />
-      Félicitation pour votre recrutement !<br />
-      Afin de faciliter votre intégration, nous avons mis en place une application vous permettant de découvrir en profondeur notre entreprise.<br /><br />
-      ${stepUnlockedString(unlockedSteps)}<br /><br />
-      Cordialement.
-    </p>
-  </body>
-</html>`;
+const welcomeTemplate = () => undefined;
 
 export { stepTemplate, welcomeTemplate };
