[Survived] ConditionalExpression
src/modules/welcome/welcome.service.ts:35:12
    * @returns The list of unlocked steps
    */
   private static getNewlyUnlockedSteps(user: WelcomeUser, now: Date): WelcomeUser["steps"][0]["_id"][] {
-    return user.steps !== undefined ? user.steps.reduce<string[]>((acc, step) => {
+    return true ? user.steps.reduce<string[]>((acc, step) => {
       if (step.unlockEmailSentAt === undefined && step.unlockDate.toDate() <= now) {
         acc.push(step._id);

[Survived] ConditionalExpression
src/modules/welcome/welcome.service.ts:35:12
    * @returns The list of unlocked steps
    */
   private static getNewlyUnlockedSteps(user: WelcomeUser, now: Date): WelcomeUser["steps"][0]["_id"][] {
-    return user.steps !== undefined ? user.steps.reduce<string[]>((acc, step) => {
+    return false ? user.steps.reduce<string[]>((acc, step) => {
       if (step.unlockEmailSentAt === undefined && step.unlockDate.toDate() <= now) {
         acc.push(step._id);

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:36:11
    */
   private static getNewlyUnlockedSteps(user: WelcomeUser, now: Date): WelcomeUser["steps"][0]["_id"][] {
     return user.steps !== undefined ? user.steps.reduce<string[]>((acc, step) => {
-      if (step.unlockEmailSentAt === undefined && step.unlockDate.toDate() <= now) {
+      if (step.unlockEmailSentAt !== undefined && step.unlockDate.toDate() <= now) {
         acc.push(step._id);
       }
killedBy: Welcome Service run should send emails to newcomers with unlocked steps when run is called (no user).
statusReason: TypeError: step.unlockDate.toDate is not a function

[Killed] LogicalOperator
src/modules/welcome/welcome.service.ts:36:11
    */
   private static getNewlyUnlockedSteps(user: WelcomeUser, now: Date): WelcomeUser["steps"][0]["_id"][] {
     return user.steps !== undefined ? user.steps.reduce<string[]>((acc, step) => {
-      if (step.unlockEmailSentAt === undefined && step.unlockDate.toDate() <= now) {
+      if (step.unlockEmailSentAt === undefined || step.unlockDate.toDate() <= now) {
         acc.push(step._id);
       }
killedBy: Welcome Service run should send emails to newcomers with unlocked steps when run is called (no user).
statusReason: TypeError: step.unlockDate.toDate is not a function

[Killed] ArithmeticOperator
src/modules/welcome/welcome.service.ts:45:28
 
   private static generatePassword(length = 12, characters = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789?.:/!@"): string {
     return Array.from(crypto.randomFillSync(new Uint32Array(length)))
-      .map(x => characters[x % characters.length])
+      .map(x => characters[x * characters.length])
       .join("");
   }
killedBy: Welcome Service createUser should generate a 12 characters password when generatePassword is called.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 12
Received length: 0
Received string: ""

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:45:12
 
   private static generatePassword(length = 12, characters = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789?.:/!@"): string {
     return Array.from(crypto.randomFillSync(new Uint32Array(length)))
-      .map(x => characters[x % characters.length])
+      .map(() => undefined)
       .join("");
   }
killedBy: Welcome Service createUser should generate a 12 characters password when generatePassword is called.
statusReason: Error: expect(received).toHaveLength(expected)

Expected length: 12
Received length: 0
Received string: ""

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:52:9
   public async createUser(createUserDto: CreateUserDto): Promise<WelcomeUser> {
     const password = WelcomeService.generatePassword();
 
-    try {
-      await this.mailService.inviteNewUserMail(createUserDto, password);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw new InternalServerErrorException();
killedBy: Welcome Service createUser should throw an InternalServerError when mailer fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:54:21
 
     try {
       await this.mailService.inviteNewUserMail(createUserDto, password);
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
 
     const gip = await this.gipService.createUser({ email: createUserDto.email, password, displayName: `${createUserDto.firstName} ${createUserDto.lastName}` });
killedBy: Welcome Service createUser should throw an InternalServerError when mailer fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Survived] ObjectLiteral
src/modules/welcome/welcome.service.ts:61:59
 
     const gip = await this.gipService.createUser({ email: createUserDto.email, password, displayName: `${createUserDto.firstName} ${createUserDto.lastName}` });
 
-    return this.createDbUser(Object.assign(createUserDto, { _id: gip.uid }));
+    return this.createDbUser(Object.assign(createUserDto, {}));
   }
 

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:66:9
 
   public async findAll(arrivalDateStart?: Date, arrivalDateEnd?: Date): Promise<WelcomeUser[]> {
     const filters: Filter[] = [];
-    if (arrivalDateStart !== undefined) {
+    if (true) {
       filters.push(Filter.where("arrivalDate", ">=", toISO8601Format(arrivalDateStart)));
     }
killedBy: Welcome Service findAll should return an user array when findAll is called (without filter).
statusReason: TypeError: Cannot read properties of undefined (reading 'toISOString')

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:66:9
 
   public async findAll(arrivalDateStart?: Date, arrivalDateEnd?: Date): Promise<WelcomeUser[]> {
     const filters: Filter[] = [];
-    if (arrivalDateStart !== undefined) {
+    if (arrivalDateStart === undefined) {
       filters.push(Filter.where("arrivalDate", ">=", toISO8601Format(arrivalDateStart)));
     }
killedBy: Welcome Service findAll should return an user array when findAll is called (without filter).
statusReason: TypeError: Cannot read properties of undefined (reading 'toISOString')

[Survived] StringLiteral
src/modules/welcome/welcome.service.ts:67:33
   public async findAll(arrivalDateStart?: Date, arrivalDateEnd?: Date): Promise<WelcomeUser[]> {
     const filters: Filter[] = [];
     if (arrivalDateStart !== undefined) {
-      filters.push(Filter.where("arrivalDate", ">=", toISO8601Format(arrivalDateStart)));
+      filters.push(Filter.where("", ">=", toISO8601Format(arrivalDateStart)));
     }
     if (arrivalDateEnd !== undefined) {

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:69:9
     if (arrivalDateStart !== undefined) {
       filters.push(Filter.where("arrivalDate", ">=", toISO8601Format(arrivalDateStart)));
     }
-    if (arrivalDateEnd !== undefined) {
+    if (arrivalDateEnd === undefined) {
       filters.push(Filter.where("arrivalDate", "<", toISO8601Format(arrivalDateEnd)));
     }
killedBy: Welcome Service findAll should return an user array when findAll is called (without filter).
statusReason: TypeError: Cannot read properties of undefined (reading 'toISOString')

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:69:9
     if (arrivalDateStart !== undefined) {
       filters.push(Filter.where("arrivalDate", ">=", toISO8601Format(arrivalDateStart)));
     }
-    if (arrivalDateEnd !== undefined) {
+    if (true) {
       filters.push(Filter.where("arrivalDate", "<", toISO8601Format(arrivalDateEnd)));
     }
killedBy: Welcome Service findAll should return an user array when findAll is called (without filter).
statusReason: TypeError: Cannot read properties of undefined (reading 'toISOString')

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:79:50
     return this.firestoreService.getDocument<WelcomeUser>(FIRESTORE_COLLECTIONS.WELCOME_USERS, id);
   }
 
-  public async remove(id: string): Promise<void> {
-    await this.findOne(id);
-    await this.firestoreService.deleteDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, id);
-    await this.gipService.deleteUser(id);
-  }
+  public async remove(id: string): Promise<void> {}
 
   public async update(id: string, updateUserDto: UpdateUserDto): Promise<WelcomeUser> {
killedBy: Welcome Service remove should delete an user when remove is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:106:27
     this.logger.debug(`User count : ${users.length}`);
 
     // for each User
-    users.forEach(user => {
-      // we get all the new Steps unlocked
-      const unlockedSteps = WelcomeService.getNewlyUnlockedSteps(user, now);
-      // selecting the most recent step in the list (fallback case : undefined)
-      const step = unlockedSteps[0] !== undefined ? steps.find(s => s._id === unlockedSteps[0]) : undefined;
-
-      this.logger.debug(user.firstName);
-
-      // if the Step is valid, generate a Promise for an email and for store the state in db
-      if (step?.unlockEmail !== undefined) {
-        userEmails.push(this.getStepEmailPromiseThenSaveState(user, unlockedSteps, step));
-      }
-    });
+    users.forEach(user => {});
 
     return Promise.allSettled(userEmails);

[Survived] EqualityOperator
src/modules/welcome/welcome.service.ts:110:20
       // we get all the new Steps unlocked
       const unlockedSteps = WelcomeService.getNewlyUnlockedSteps(user, now);
       // selecting the most recent step in the list (fallback case : undefined)
-      const step = unlockedSteps[0] !== undefined ? steps.find(s => s._id === unlockedSteps[0]) : undefined;
+      const step = unlockedSteps[0] === undefined ? steps.find(s => s._id === unlockedSteps[0]) : undefined;
 
       this.logger.debug(user.firstName);

[NoCoverage] EqualityOperator
src/modules/welcome/welcome.service.ts:110:69
       // we get all the new Steps unlocked
       const unlockedSteps = WelcomeService.getNewlyUnlockedSteps(user, now);
       // selecting the most recent step in the list (fallback case : undefined)
-      const step = unlockedSteps[0] !== undefined ? steps.find(s => s._id === unlockedSteps[0]) : undefined;
+      const step = unlockedSteps[0] !== undefined ? steps.find(s => s._id !== unlockedSteps[0]) : undefined;
 
       this.logger.debug(user.firstName);

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:115:11
       this.logger.debug(user.firstName);
 
       // if the Step is valid, generate a Promise for an email and for store the state in db
-      if (step?.unlockEmail !== undefined) {
+      if (step?.unlockEmail === undefined) {
         userEmails.push(this.getStepEmailPromiseThenSaveState(user, unlockedSteps, step));
       }
killedBy: Welcome Service run should send emails to newcomers with unlocked steps when run is called (no user).
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 6

- Array []
+ Array [
+   Object {

[Killed] OptionalChaining
src/modules/welcome/welcome.service.ts:115:11
       this.logger.debug(user.firstName);
 
       // if the Step is valid, generate a Promise for an email and for store the state in db
-      if (step?.unlockEmail !== undefined) {
+      if (step.unlockEmail !== undefined) {
         userEmails.push(this.getStepEmailPromiseThenSaveState(user, unlockedSteps, step));
       }
killedBy: Welcome Service run should send emails to newcomers with unlocked steps when run is called (no user).
statusReason: TypeError: Cannot read properties of undefined (reading 'unlockEmail')

[NoCoverage] BlockStatement
src/modules/welcome/welcome.service.ts:123:120
     return Promise.allSettled(userEmails);
   }
 
-  public async getStepEmailPromiseThenSaveState(user: WelcomeUser, unlockedSteps: string[], step: Step): Promise<void> {
-    await this.updateEmailSteps(user, unlockedSteps);
-    await this.mailService.sendStepMail(user, step.unlockEmail, step._id);
-  }
+  public async getStepEmailPromiseThenSaveState(user: WelcomeUser, unlockedSteps: string[], step: Step): Promise<void> {}
 
   /**

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:139:29
     const user = await this.findOne(userId);
     const step = await this.stepService.findOne(stepId);
     const newSteps = user.steps.map(s => {
-      if (s._id !== stepId) {
-        return s;
-      }
+      if (s._id !== stepId) {}
       return {
         ...s,
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "4da2458e295dcaae607fecee",
@@ -1,8 +1,8 @@

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:139:11
     const user = await this.findOne(userId);
     const step = await this.stepService.findOne(stepId);
     const newSteps = user.steps.map(s => {
-      if (s._id !== stepId) {
+      if (false) {
         return s;
       }
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "6ee649fad70b1f3a28937fcc",
@@ -1,8 +1,8 @@

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:147:43
         subStepsCompleted: subStep,
       };
     });
-    const isStepCompleted = newSteps.find(s => s._id === stepId).subStepsCompleted === step.subSteps;
+    const isStepCompleted = newSteps.find(() => undefined).subStepsCompleted === step.subSteps;
     if (isStepCompleted) {
       newSteps.find(s => s._id === stepId).completedAt = completedAt;
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: TypeError: Cannot read properties of undefined (reading 'subStepsCompleted')

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:147:48
         subStepsCompleted: subStep,
       };
     });
-    const isStepCompleted = newSteps.find(s => s._id === stepId).subStepsCompleted === step.subSteps;
+    const isStepCompleted = newSteps.find(s => false).subStepsCompleted === step.subSteps;
     if (isStepCompleted) {
       newSteps.find(s => s._id === stepId).completedAt = completedAt;
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: TypeError: Cannot read properties of undefined (reading 'subStepsCompleted')

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:148:26
       };
     });
     const isStepCompleted = newSteps.find(s => s._id === stepId).subStepsCompleted === step.subSteps;
-    if (isStepCompleted) {
-      newSteps.find(s => s._id === stepId).completedAt = completedAt;
-    }
+    if (isStepCompleted) {}
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
     try {
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "cdbe73b6ee5d61cc1288b076",
@@ -7,14 +7,11 @@

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:148:9
       };
     });
     const isStepCompleted = newSteps.find(s => s._id === stepId).subStepsCompleted === step.subSteps;
-    if (isStepCompleted) {
+    if (false) {
       newSteps.find(s => s._id === stepId).completedAt = completedAt;
     }
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "dabceef091b45f6e1bfd59ee",
@@ -7,14 +7,11 @@

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:149:21
     });
     const isStepCompleted = newSteps.find(s => s._id === stepId).subStepsCompleted === step.subSteps;
     if (isStepCompleted) {
-      newSteps.find(s => s._id === stepId).completedAt = completedAt;
+      newSteps.find(() => undefined).completedAt = completedAt;
     }
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: TypeError: Cannot set properties of undefined (setting 'completedAt')

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:149:26
     });
     const isStepCompleted = newSteps.find(s => s._id === stepId).subStepsCompleted === step.subSteps;
     if (isStepCompleted) {
-      newSteps.find(s => s._id === stepId).completedAt = completedAt;
+      newSteps.find(s => false).completedAt = completedAt;
     }
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: TypeError: Cannot set properties of undefined (setting 'completedAt')

[Killed] ObjectLiteral
src/modules/welcome/welcome.service.ts:151:95
     if (isStepCompleted) {
       newSteps.find(s => s._id === stepId).completedAt = completedAt;
     }
-    await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
+    await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {});
     try {
       if (isStepCompleted) {
killedBy: Welcome Service updateSubStep should complete user sub step when completeStep is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "336ae05501d1ad6850fe1e4b",
- Object {

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:152:9
       newSteps.find(s => s._id === stepId).completedAt = completedAt;
     }
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
-    try {
-      if (isStepCompleted) {
-        await this.notifyCompletedStep(user, step);
-      }
-    } catch (err) {
+    try {} catch (err) {
       Logger.error(err);
 

[Survived] BlockStatement
src/modules/welcome/welcome.service.ts:153:28
     }
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
     try {
-      if (isStepCompleted) {
-        await this.notifyCompletedStep(user, step);
-      }
+      if (isStepCompleted) {}
     } catch (err) {
       Logger.error(err);

[Survived] ConditionalExpression
src/modules/welcome/welcome.service.ts:153:11
     }
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, { steps: newSteps });
     try {
-      if (isStepCompleted) {
+      if (false) {
         await this.notifyCompletedStep(user, step);
       }

[NoCoverage] BlockStatement
src/modules/welcome/welcome.service.ts:156:19
       if (isStepCompleted) {
         await this.notifyCompletedStep(user, step);
       }
-    } catch (err) {
-      Logger.error(err);
-
-      return newSteps;
-    }
+    } catch (err) {}
     return newSteps;
   }

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:169:93
    * @param user - The user to update
    * @param unlockedSteps - The list of steps to update
    */
-  private async updateEmailSteps(user: WelcomeUser, unlockedSteps: string[]): Promise<void> {
-    const unlockEmailSentAt = Timestamp.now();
-
-    await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map(step => (unlockedSteps.includes(step._id) ? { ...step, unlockEmailSentAt } : step)),
-    });
-  }
+  private async updateEmailSteps(user: WelcomeUser, unlockedSteps: string[]): Promise<void> {}
 
   private async notifyCompletedStep(user: WelcomeUser, step: Step): Promise<void> {
killedBy: Welcome Service updateEmailSteps should update email steps when updateEmailSteps is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ArrowFunction
src/modules/welcome/welcome.service.ts:173:29
     const unlockEmailSentAt = Timestamp.now();
 
     await this.firestoreService.updateDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, user._id, {
-      steps: user.steps.map(step => (unlockedSteps.includes(step._id) ? { ...step, unlockEmailSentAt } : step)),
+      steps: user.steps.map(() => undefined),
     });
   }
killedBy: Welcome Service updateEmailSteps should update email steps when updateEmailSteps is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "WelcomeDatabase_users",
  "b8df6a5b5272c5f1b3cf80dd",
  Object {

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:177:83
     });
   }
 
-  private async notifyCompletedStep(user: WelcomeUser, step: Step): Promise<void> {
-    if (step.completionEmailManager !== undefined) {
-      await this.mailService.sendStepMail(user, step.completionEmailManager, step._id);
-    }
-
-    if (step.completionEmail !== undefined) {
-      await this.mailService.sendStepMail(user, step.completionEmail, step._id);
-    }
-  }
+  private async notifyCompletedStep(user: WelcomeUser, step: Step): Promise<void> {}
 
   private async createDbUser(createUserDto: CreateUserDto): Promise<WelcomeUser> {
killedBy: Welcome Service notifyCompletedStep should send step mail when completion email manager is set.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:178:9
   }
 
   private async notifyCompletedStep(user: WelcomeUser, step: Step): Promise<void> {
-    if (step.completionEmailManager !== undefined) {
+    if (false) {
       await this.mailService.sendStepMail(user, step.completionEmailManager, step._id);
     }
killedBy: Welcome Service notifyCompletedStep should send step mail when completion email manager is set.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] ConditionalExpression
src/modules/welcome/welcome.service.ts:178:9
   }
 
   private async notifyCompletedStep(user: WelcomeUser, step: Step): Promise<void> {
-    if (step.completionEmailManager !== undefined) {
+    if (true) {
       await this.mailService.sendStepMail(user, step.completionEmailManager, step._id);
     }
killedBy: Welcome Service notifyCompletedStep should send step mail when completion email is set.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Killed] BlockStatement
src/modules/welcome/welcome.service.ts:182:45
       await this.mailService.sendStepMail(user, step.completionEmailManager, step._id);
     }
 
-    if (step.completionEmail !== undefined) {
-      await this.mailService.sendStepMail(user, step.completionEmail, step._id);
-    }
+    if (step.completionEmail !== undefined) {}
   }
 
killedBy: Welcome Service notifyCompletedStep should send step mail when completion email is set.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] EqualityOperator
src/modules/welcome/welcome.service.ts:182:9
       await this.mailService.sendStepMail(user, step.completionEmailManager, step._id);
     }
 
-    if (step.completionEmail !== undefined) {
+    if (step.completionEmail === undefined) {
       await this.mailService.sendStepMail(user, step.completionEmail, step._id);
     }
killedBy: Welcome Service notifyCompletedStep should send step mail when completion email manager is set.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 2

[Survived] ObjectLiteral
src/modules/welcome/welcome.service.ts:195:66
       new Date(createUserDto.arrivalDate),
     );
 
-    const dbUser = Object.assign(instanceToPlain(createUserDto), {
-      steps: steps.map(s => ({
-        _id: s.step._id,
-        unlockDate: Timestamp.fromDate(s.dt),
-        subStepsCompleted: 0,
-      })),
-      creationDate: now,
-      lastUpdate: now,
-    });
+    const dbUser = Object.assign(instanceToPlain(createUserDto), {});
 
     return this.firestoreService.saveDocument(FIRESTORE_COLLECTIONS.WELCOME_USERS, dbUser);

[Survived] ArrowFunction
src/modules/welcome/welcome.service.ts:196:24
     );
 
     const dbUser = Object.assign(instanceToPlain(createUserDto), {
-      steps: steps.map(s => ({
-        _id: s.step._id,
-        unlockDate: Timestamp.fromDate(s.dt),
-        subStepsCompleted: 0,
-      })),
+      steps: steps.map(() => undefined),
       creationDate: now,
       lastUpdate: now,
