[Killed] BlockStatement
src/services/cognito/cognito.service.ts:19:69
 
   private readonly verifier: Verifier;
 
-  public constructor(private readonly configService: ConfigService) {
-    this.issuerUrl = `https://cognito-idp.${this.configService.get("COGNITO_REGION")}.amazonaws.com/${this.configService.get("COGNITO_USER_POOL_ID")}`;
-    try {
-      this.verifier = CognitoJwtVerifier.create({
-        userPoolId: this.configService.get("COGNITO_USER_POOL_ID"),
-        tokenUse: "access",
-        clientId: this.configService.get("COGNITO_CLIENT_ID"),
-      });
-    } catch (error) {
-      throw new InternalServerErrorException(error);
-    }
-  }
+  public constructor(private readonly configService: ConfigService) {}
 
   public async verifyIdToken(token: string): Promise<ReturnType<Verifier["verify"]>> {
killedBy: CognitoService verifyIdToken should return decoded token when verifyIdToken success.
statusReason: Error: Cannot use spyOn on a primitive value; undefined given

[Survived] StringLiteral
src/services/cognito/cognito.service.ts:20:126
   private readonly verifier: Verifier;
 
   public constructor(private readonly configService: ConfigService) {
-    this.issuerUrl = `https://cognito-idp.${this.configService.get("COGNITO_REGION")}.amazonaws.com/${this.configService.get("COGNITO_USER_POOL_ID")}`;
+    this.issuerUrl = `https://cognito-idp.${this.configService.get("COGNITO_REGION")}.amazonaws.com/${this.configService.get("")}`;
     try {
       this.verifier = CognitoJwtVerifier.create({

[Killed] BlockStatement
src/services/cognito/cognito.service.ts:21:9
 
   public constructor(private readonly configService: ConfigService) {
     this.issuerUrl = `https://cognito-idp.${this.configService.get("COGNITO_REGION")}.amazonaws.com/${this.configService.get("COGNITO_USER_POOL_ID")}`;
-    try {
-      this.verifier = CognitoJwtVerifier.create({
-        userPoolId: this.configService.get("COGNITO_USER_POOL_ID"),
-        tokenUse: "access",
-        clientId: this.configService.get("COGNITO_CLIENT_ID"),
-      });
-    } catch (error) {
+    try {} catch (error) {
       throw new InternalServerErrorException(error);
     }
killedBy: CognitoService verifyIdToken should return decoded token when verifyIdToken success.
statusReason: Error: Cannot use spyOn on a primitive value; undefined given

[Survived] StringLiteral
src/services/cognito/cognito.service.ts:23:44
     this.issuerUrl = `https://cognito-idp.${this.configService.get("COGNITO_REGION")}.amazonaws.com/${this.configService.get("COGNITO_USER_POOL_ID")}`;
     try {
       this.verifier = CognitoJwtVerifier.create({
-        userPoolId: this.configService.get("COGNITO_USER_POOL_ID"),
+        userPoolId: this.configService.get(""),
         tokenUse: "access",
         clientId: this.configService.get("COGNITO_CLIENT_ID"),

[NoCoverage] BlockStatement
src/services/cognito/cognito.service.ts:27:21
         tokenUse: "access",
         clientId: this.configService.get("COGNITO_CLIENT_ID"),
       });
-    } catch (error) {
-      throw new InternalServerErrorException(error);
-    }
+    } catch (error) {}
   }
 

[Killed] BlockStatement
src/services/cognito/cognito.service.ts:35:21
   public async verifyIdToken(token: string): Promise<ReturnType<Verifier["verify"]>> {
     try {
       return await this.verifier.verify(token);
-    } catch (error) {
-      throw new UnauthorizedException(error);
-    }
+    } catch (error) {}
   }
 }
killedBy: CognitoService verifyIdToken should throw when verifyIdToken fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError
