[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:34:29
     const documents: T[] = [];
     try {
       const query = parentDoc.collection(collection);
-      const filteredQuery = filter !== undefined ? query.where(filter) : query;
+      const filteredQuery = false ? query.where(filter) : query;
       const querySnapshot = await filteredQuery.get();
       querySnapshot.forEach(docData => {

[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:34:29
     const documents: T[] = [];
     try {
       const query = parentDoc.collection(collection);
-      const filteredQuery = filter !== undefined ? query.where(filter) : query;
+      const filteredQuery = true ? query.where(filter) : query;
       const querySnapshot = await filteredQuery.get();
       querySnapshot.forEach(docData => {

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:36:40
       const query = parentDoc.collection(collection);
       const filteredQuery = filter !== undefined ? query.where(filter) : query;
       const querySnapshot = await filteredQuery.get();
-      querySnapshot.forEach(docData => {
-        documents.push({
-          ...(docData.data() as T),
-        });
-      });
+      querySnapshot.forEach(docData => {});
 
       return documents;
killedBy: FirestoreService getAllDocuments should return an array when no filters.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 10
+ Received  +  1

- Array [
-   Object {
-     "_id": "1",

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:43:21
       });
 
       return documents;
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: FirestoreService getAllDocuments should throw an InternalServerError when database fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BooleanLiteral
src/services/firestore/firestore.service.ts:56:11
   ): Promise<T> {
     try {
       const documentSnapshot = await parentDoc.collection(collection).doc(documentId).get();
-      if (!documentSnapshot.exists) {
+      if (documentSnapshot.exists) {
         throw new NotFoundException("Document not found in DB");
       }
killedBy: FirestoreService getDocument should return not found when documentId exists.
statusReason: NotFoundException: Document not found in DB

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:56:11
   ): Promise<T> {
     try {
       const documentSnapshot = await parentDoc.collection(collection).doc(documentId).get();
-      if (!documentSnapshot.exists) {
+      if (true) {
         throw new NotFoundException("Document not found in DB");
       }
killedBy: FirestoreService getDocument should return not found when documentId exists.
statusReason: NotFoundException: Document not found in DB

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:60:21
         throw new NotFoundException("Document not found in DB");
       }
       return documentSnapshot.data() as T;
-    } catch (error) {
-      if (error instanceof NotFoundException) {
-        throw error;
-      }
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: FirestoreService getDocument should return not found when documentId does not exists.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:61:11
       }
       return documentSnapshot.data() as T;
     } catch (error) {
-      if (error instanceof NotFoundException) {
+      if (false) {
         throw error;
       }
killedBy: FirestoreService getDocument should return not found when documentId does not exists.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundException
Received constructor: InternalServerErrorException

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:61:47
       }
       return documentSnapshot.data() as T;
     } catch (error) {
-      if (error instanceof NotFoundException) {
-        throw error;
-      }
+      if (error instanceof NotFoundException) {}
       this.logger.error(error);
       throw new InternalServerErrorException();
killedBy: FirestoreService getDocument should return not found when documentId does not exists.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: NotFoundException
Received constructor: InternalServerErrorException

[Survived] StringLiteral
src/services/firestore/firestore.service.ts:75:58
     parentDoc: DocumentReference | Firestore = this.firestore,
   ): Promise<T> {
     try {
-      let id = typeof data._id === "string" ? data._id : "";
+      let id = typeof data._id === "string" ? data._id : "Stryker was here!";
       const documentRef = id !== "" ? parentDoc.collection(collection).doc(id) : parentDoc.collection(collection).doc();
       id = documentRef.id;

[Survived] ConditionalExpression
src/services/firestore/firestore.service.ts:76:27
   ): Promise<T> {
     try {
       let id = typeof data._id === "string" ? data._id : "";
-      const documentRef = id !== "" ? parentDoc.collection(collection).doc(id) : parentDoc.collection(collection).doc();
+      const documentRef = true ? parentDoc.collection(collection).doc(id) : parentDoc.collection(collection).doc();
       id = documentRef.id;
       await documentRef.create({ ...data, _id: id });

[Survived] EqualityOperator
src/services/firestore/firestore.service.ts:76:27
   ): Promise<T> {
     try {
       let id = typeof data._id === "string" ? data._id : "";
-      const documentRef = id !== "" ? parentDoc.collection(collection).doc(id) : parentDoc.collection(collection).doc();
+      const documentRef = id === "" ? parentDoc.collection(collection).doc(id) : parentDoc.collection(collection).doc();
       id = documentRef.id;
       await documentRef.create({ ...data, _id: id });

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:82:21
       this.logger.log(`[saveDocument] - data saved to database, id:${id}`);
 
       return await this.getDocument(collection, id, parentDoc);
-    } catch (error) {
-      if (error instanceof Error) {
-        if ("code" in error && error.code === FirestoreErrorCode.ALREADY_EXISTS) {
-          throw new ConflictException("Document already exists.");
-        }
-      }
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: FirestoreService saveDocument should throw a ConflictException when document already exists.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:83:35
 
       return await this.getDocument(collection, id, parentDoc);
     } catch (error) {
-      if (error instanceof Error) {
-        if ("code" in error && error.code === FirestoreErrorCode.ALREADY_EXISTS) {
-          throw new ConflictException("Document already exists.");
-        }
-      }
+      if (error instanceof Error) {}
       this.logger.error(error);
       throw new InternalServerErrorException();
killedBy: FirestoreService saveDocument should throw a ConflictException when document already exists.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ConflictException
Received constructor: InternalServerErrorException

[Killed] ConditionalExpression
src/services/firestore/firestore.service.ts:84:13
       return await this.getDocument(collection, id, parentDoc);
     } catch (error) {
       if (error instanceof Error) {
-        if ("code" in error && error.code === FirestoreErrorCode.ALREADY_EXISTS) {
+        if (true) {
           throw new ConflictException("Document already exists.");
         }
killedBy: FirestoreService saveDocument should throw an InternalServerError when database fails.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: InternalServerErrorException
Received constructor: ConflictException

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:84:82
       return await this.getDocument(collection, id, parentDoc);
     } catch (error) {
       if (error instanceof Error) {
-        if ("code" in error && error.code === FirestoreErrorCode.ALREADY_EXISTS) {
-          throw new ConflictException("Document already exists.");
-        }
+        if ("code" in error && error.code === FirestoreErrorCode.ALREADY_EXISTS) {}
       }
       this.logger.error(error);
killedBy: FirestoreService saveDocument should throw a ConflictException when document already exists.
statusReason: Error: expect(received).toBeInstanceOf(expected)

Expected constructor: ConflictException
Received constructor: InternalServerErrorException

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:106:21
         .update({ ...data });
 
       return await this.getDocument(collection, documentId);
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: FirestoreService updateDocument should throw an InternalServerError when database fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:116:20
     collection: FIRESTORE_COLLECTIONS,
     documentId: string,
     parentDoc: DocumentReference | Firestore = this.firestore,
-  ): Promise<void> {
-    try {
-      await parentDoc.collection(collection).doc(documentId).delete();
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
-  }
+  ): Promise<void> {}
 
   public async deleteRecursive(doc: DocumentReference): Promise<void> {
killedBy: FirestoreService deleteDocument should delete when deleteDocument is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:117:9
     documentId: string,
     parentDoc: DocumentReference | Firestore = this.firestore,
   ): Promise<void> {
-    try {
-      await parentDoc.collection(collection).doc(documentId).delete();
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw new InternalServerErrorException();
killedBy: FirestoreService deleteDocument should delete when deleteDocument is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:119:21
   ): Promise<void> {
     try {
       await parentDoc.collection(collection).doc(documentId).delete();
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: FirestoreService deleteDocument should throw an InternalServerError when database fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:125:71
     }
   }
 
-  public async deleteRecursive(doc: DocumentReference): Promise<void> {
-    try {
-      await this.firestore.recursiveDelete(doc);
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
-  }
+  public async deleteRecursive(doc: DocumentReference): Promise<void> {}
 
   public async updateManyDocuments(
killedBy: FirestoreService deleteRecursive should delete when deleteRecursive is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:126:9
   }
 
   public async deleteRecursive(doc: DocumentReference): Promise<void> {
-    try {
-      await this.firestore.recursiveDelete(doc);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw new InternalServerErrorException();
killedBy: FirestoreService deleteRecursive should delete when deleteRecursive is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:128:21
   public async deleteRecursive(doc: DocumentReference): Promise<void> {
     try {
       await this.firestore.recursiveDelete(doc);
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: FirestoreService deleteRecursive should throw an InternalServerError when database fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:138:20
     collection: FIRESTORE_COLLECTIONS,
     filter: Filter,
     data: Record<string, unknown>,
-  ): Promise<void> {
-    try {
-      const collectionRef = this.firestore.collection(collection);
-
-      let query = collectionRef as Query;
-      Object.keys(filter).forEach(key => {
-        query = query.where(key, "==", filter[key]);
-      });
-
-      const snapshot = await query.get();
-      const batch = this.firestore.batch();
-      snapshot.forEach(doc => {
-        const docRef = collectionRef.doc(doc.id);
-        batch.update(docRef, data);
-      });
-
-      await batch.commit();
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
-  }
+  ): Promise<void> {}
 }
killedBy: FirestoreService updateManyDocuments should update many documents when updateManyDocuments is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:139:9
     filter: Filter,
     data: Record<string, unknown>,
   ): Promise<void> {
-    try {
-      const collectionRef = this.firestore.collection(collection);
-
-      let query = collectionRef as Query;
-      Object.keys(filter).forEach(key => {
-        query = query.where(key, "==", filter[key]);
-      });
-
-      const snapshot = await query.get();
-      const batch = this.firestore.batch();
-      snapshot.forEach(doc => {
-        const docRef = collectionRef.doc(doc.id);
-        batch.update(docRef, data);
-      });
-
-      await batch.commit();
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error(error);
       throw new InternalServerErrorException();
killedBy: FirestoreService updateManyDocuments should update many documents when updateManyDocuments is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Survived] BlockStatement
src/services/firestore/firestore.service.ts:143:42
       const collectionRef = this.firestore.collection(collection);
 
       let query = collectionRef as Query;
-      Object.keys(filter).forEach(key => {
-        query = query.where(key, "==", filter[key]);
-      });
+      Object.keys(filter).forEach(key => {});
 
       const snapshot = await query.get();

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:149:31
 
       const snapshot = await query.get();
       const batch = this.firestore.batch();
-      snapshot.forEach(doc => {
-        const docRef = collectionRef.doc(doc.id);
-        batch.update(docRef, data);
-      });
+      snapshot.forEach(doc => {});
 
       await batch.commit();
killedBy: FirestoreService updateManyDocuments should update many documents when updateManyDocuments is called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 2
Received number of calls: 0

[Killed] BlockStatement
src/services/firestore/firestore.service.ts:155:21
       });
 
       await batch.commit();
-    } catch (error) {
-      this.logger.error(error);
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 }
killedBy: FirestoreService updateManyDocuments should throw an InternalServerError when database fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError
