[Survived] BlockStatement
src/services/gip/gip.service.ts:13:5
     private readonly auth: Auth,
     private readonly logger: Logger,
     private readonly configService: ConfigService,
-  ) {
-    this.issuerUrl = `https://securetoken.google.com/${this.configService.get("PROJECT_ID")}`;
-  }
+  ) {}
 
   public async verifyIdToken(token: string): Promise<DecodedIdToken> {

[Survived] StringLiteral
src/services/gip/gip.service.ts:14:79
     private readonly logger: Logger,
     private readonly configService: ConfigService,
   ) {
-    this.issuerUrl = `https://securetoken.google.com/${this.configService.get("PROJECT_ID")}`;
+    this.issuerUrl = `https://securetoken.google.com/${this.configService.get("")}`;
   }
 

[Killed] BlockStatement
src/services/gip/gip.service.ts:24:21
   public async createUser(properties: CreateRequest): Promise<UserRecord> {
     try {
       return await this.auth.createUser(properties);
-    } catch (error) {
-      if (error instanceof Error) {
-        this.logger.error(error.message);
-      }
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 
killedBy: GipService createUser should throw when createUser fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError

[Killed] BlockStatement
src/services/gip/gip.service.ts:32:55
     }
   }
 
-  public async deleteUser(uid: string): Promise<void> {
-    try {
-      await this.auth.deleteUser(uid);
-    } catch (error) {
-      if (error instanceof Error) {
-        this.logger.error(error.message);
-      }
-      throw new InternalServerErrorException();
-    }
-  }
+  public async deleteUser(uid: string): Promise<void> {}
 }
killedBy: GipService deleteUser should return void when deleteUser.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/gip/gip.service.ts:33:9
   }
 
   public async deleteUser(uid: string): Promise<void> {
-    try {
-      await this.auth.deleteUser(uid);
-    } catch (error) {
+    try {} catch (error) {
       if (error instanceof Error) {
         this.logger.error(error.message);
killedBy: GipService deleteUser should return void when deleteUser.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/gip/gip.service.ts:35:21
   public async deleteUser(uid: string): Promise<void> {
     try {
       await this.auth.deleteUser(uid);
-    } catch (error) {
-      if (error instanceof Error) {
-        this.logger.error(error.message);
-      }
-      throw new InternalServerErrorException();
-    }
+    } catch (error) {}
   }
 }
killedBy: GipService deleteUser should throw when deleteUser fails.
statusReason: Error: expect(received).not.toBeInstanceOf(expected)

Expected constructor: not NoErrorThrownError
