[Killed] BlockStatement
src/services/mail/mail.service.ts:19:5
   public constructor(
     private readonly logger: Logger,
     private readonly config: ConfigService,
-  ) {
-    const brevoApiKey = this.config.get<string>("BREVO_API_KEY");
-    this.brevoMailingInstance.setApiKey(TransactionalEmailsApiApiKeys.apiKey, brevoApiKey);
-  }
+  ) {}
 
   public async sendStepMail(user: WelcomeUser, stepEmail: StepEmail, stepId: string): Promise<void> {
killedBy: Mail Service Service constructor should get brevo api key from config when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/services/mail/mail.service.ts:20:49
     private readonly logger: Logger,
     private readonly config: ConfigService,
   ) {
-    const brevoApiKey = this.config.get<string>("BREVO_API_KEY");
+    const brevoApiKey = this.config.get<string>("");
     this.brevoMailingInstance.setApiKey(TransactionalEmailsApiApiKeys.apiKey, brevoApiKey);
   }
killedBy: Mail Service Service constructor should get brevo api key from config when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "BREVO_API_KEY"
Received: ""

Number of calls: 1

[Killed] BlockStatement
src/services/mail/mail.service.ts:24:101
     this.brevoMailingInstance.setApiKey(TransactionalEmailsApiApiKeys.apiKey, brevoApiKey);
   }
 
-  public async sendStepMail(user: WelcomeUser, stepEmail: StepEmail, stepId: string): Promise<void> {
-    const data: StepMailData = {
-      ...this.getCommonMailData(user),
-      managerFirstName: user.hrReferent.firstName,
-      managerLastName: user.hrReferent.lastName,
-      stepId,
-    };
-    const templateName = `step-${stepId}` as MailTemplateName;
-    const templatePath = this.getMailTemplatePath(templateName);
-
-    await this.sendMail({
-      to: user.email,
-      subject: stepEmail.subject,
-      html: await renderFile(templatePath, data),
-    });
-  }
+  public async sendStepMail(user: WelcomeUser, stepEmail: StepEmail, stepId: string): Promise<void> {}
 
   public async inviteNewUserMail(createUserDto: CreateUserDto, password: string): Promise<void> {
killedBy: Mail Service Service sendStepMail should render mail template when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/mail/mail.service.ts:41:97
     });
   }
 
-  public async inviteNewUserMail(createUserDto: CreateUserDto, password: string): Promise<void> {
-    const data: InviteNewUserMailData = {
-      ...this.getCommonMailData(createUserDto),
-      email: createUserDto.email,
-      password,
-    };
-    const templatePath = this.getMailTemplatePath("new-user");
-
-    await this.sendMail({
-      to: createUserDto.email,
-      subject: "Sujet [Welcome] Tes identifiants de connexion",
-      html: await renderFile(templatePath, data),
-    });
-  }
+  public async inviteNewUserMail(createUserDto: CreateUserDto, password: string): Promise<void> {}
 
   private getMailTemplatePath(templateName: MailTemplateName): string {
killedBy: Mail Service Service inviteNewUserMail should render mail template when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] StringLiteral
src/services/mail/mail.service.ts:51:16
 
     await this.sendMail({
       to: createUserDto.email,
-      subject: "Sujet [Welcome] Tes identifiants de connexion",
+      subject: "",
       html: await renderFile(templatePath, data),
     });
killedBy: Mail Service Service inviteNewUserMail should send mail when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "html": "<h1>Mocked HTML</h1>",
-   "subject": "Sujet [Welcome] Tes identifiants de connexion",

[Killed] StringLiteral
src/services/mail/mail.service.ts:57:48
   }
 
   private getMailTemplatePath(templateName: MailTemplateName): string {
-    return path.join(__dirname, "/templates/", `${templateName}.mail-template.ejs`);
+    return path.join(__dirname, "/templates/", ``);
   }
 
killedBy: Mail Service Service getMailTemplatePath should return mail template path when called.
statusReason: Error: expect(received).toContain(expected) // indexOf

Expected substring: "src/services/mail/templates/new-user.mail-template.ejs"
Received string:    "/Users/antoinezanardi/WebstormProjects/welcome-hub-back/.stryker-tmp/sandbox1552037/src/services/mail/templates/"

[Killed] BlockStatement
src/services/mail/mail.service.ts:69:75
     };
   }
 
-  private async sendMail(mailRequirement: MailRequirement): Promise<void> {
-    try {
-      const mail = this.getSmtpMailFromRequirement(mailRequirement);
-      await this.brevoMailingInstance.sendTransacEmail(mail);
-      this.logger.log(`Email successfully dispatched to ${mailRequirement.to}`);
-    } catch (error) {
-      this.logger.error("Error while sending email", error);
-      throw error;
-    }
-  }
+  private async sendMail(mailRequirement: MailRequirement): Promise<void> {}
 
   private getSmtpMailFromRequirement(mailRequirement: MailRequirement): SendSmtpEmail {
killedBy: Mail Service Service sendMail should get smtp mail from provided requirements when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/mail/mail.service.ts:70:9
   }
 
   private async sendMail(mailRequirement: MailRequirement): Promise<void> {
-    try {
-      const mail = this.getSmtpMailFromRequirement(mailRequirement);
-      await this.brevoMailingInstance.sendTransacEmail(mail);
-      this.logger.log(`Email successfully dispatched to ${mailRequirement.to}`);
-    } catch (error) {
+    try {} catch (error) {
       this.logger.error("Error while sending email", error);
       throw error;
killedBy: Mail Service Service sendMail should get smtp mail from provided requirements when called.
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

[Killed] BlockStatement
src/services/mail/mail.service.ts:74:21
       const mail = this.getSmtpMailFromRequirement(mailRequirement);
       await this.brevoMailingInstance.sendTransacEmail(mail);
       this.logger.log(`Email successfully dispatched to ${mailRequirement.to}`);
-    } catch (error) {
-      this.logger.error("Error while sending email", error);
-      throw error;
-    }
+    } catch (error) {}
   }
 
killedBy: Mail Service Service sendMail should throw error when send transaction email fails.
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ArrayDeclaration
src/services/mail/mail.service.ts:82:15
 
   private getSmtpMailFromRequirement(mailRequirement: MailRequirement): SendSmtpEmail {
     const mail = new SendSmtpEmail();
-    mail.to = [{ email: mailRequirement.to }];
+    mail.to = [];
     mail.sender = {
       name: MAIL_FROM_NAME,
killedBy: Mail Service Service getSmtpMailFromRequirement should get smtp mail from provided requirements when called.
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

@@ -3,11 +3,7 @@
    "sender": Object {
      "email": "welcome@daveo.fr",
